[
  {
    "date": "Thursday, April 10",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "All Levels BURLESQUE JAZZ with Tony Guerrero",
    "staff": "Madeline Benoit (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Thursday, April 10",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Adv Beg TAP with Gwen Potter",
    "staff": "Gwen Potter",
    "room": "Room:Studio B",
    "instructor": "Gwen Potter",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/gwen-potter",
    "description": "Gwen prioritizes three main elements in her tap class. First she focuses on fostering a solid understanding of tap vocabulary; using rudiments to drill basic skills for time, speed, and execution. Across the floor and basic rudiments warm up students' feet and minds for center work later in class. She then focuses on sequencing; taking steps and stringing them together to practice picking up choreography quickly. Lastly, improvisation; Gwen provides a charismatic, gentle approach to the introduction of basic music theory and guides students to apply their musical knowledge to their feet.Whether you are looking to strengthen your feet for an upcoming audition, in the city for fun, or looking to expand your knowledge and education further, all are welcome. Having a background in both musical theatre and commercial dance her style is an ever evolving melting pot as she continues to be inspired by people, places, and experiences daily."
  },
  {
    "date": "Thursday, April 10",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic BALLET with Erica Ratkovicz",
    "staff": "June Chin (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Thursday, April 10",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Beg THEATER with Josh Zacher",
    "staff": "Josh Zacher",
    "room": "Room:Studio 4",
    "instructor": "Josh Zacher",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/josh-zacher",
    "description": "Josh’s theatre dance class is open to all levels and backgrounds. The class begins with a comprehensive warm up utilizing components of ballet, conditioning, isolation, stretching, and flow followed by a combination in Josh’s theatrical style. Josh’s style draws inspiration from many of the great musical theatre choreographers while incorporating elements of commercial jazz, street styles, and contemporary. Previous students have characterized the combinations as athletic, highly musical, full out, diverse, exciting, and actor friendly. It is always a goal to help the students incorporate elements of storytelling and world building into their work on the combination in addition to mechanical and technical skills."
  },
  {
    "date": "Thursday, April 10",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Adv Beg STREET JAZZ/HIP-HOP with Carlos Neto",
    "staff": "Carlos Neto",
    "room": "Room:Studio 5",
    "instructor": "Carlos Neto",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/carlos-neto",
    "description": ""
  },
  {
    "date": "Thursday, April 10",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Adv Beg HEELS with Hector Lopez",
    "staff": "Hector Lopez",
    "room": "Room:Studio 3",
    "instructor": "Hector Lopez",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/hector-lopez",
    "description": "Hector works to establish an environment in which students are building a strong technical foundation and claiming ownership of the information. In doing so, they are able to apply the technique when working and learning other styles.Heels do not only physically elevate you, they instill a sense of power and authority. As an educator, Hector strives to empower his students to fearlessly be themselves rather than assume an alter ego."
  },
  {
    "date": "Thursday, April 10",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic HIP-HOP with Angel Kaba",
    "staff": "Jevon \"Jerzey\" Goldson (substitute)",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class will explore the social dance aspect of Hip-Hop focusing on rhythms, foundation, culture, and choreography. The class starts off with a warm-up by stretching out the body, followed by exercises and drills, focusing on groove, musicality, freestyle, and sometimes some history of Hip-Hop culture. The most important aspect of this class is DANCE, learning or relearning how to dance and take a dance class, in opposition to only executing Hip-Hop steps, and choreographies. Angel will support you to focus on yourself, your groove, your musicality, and your ability to move your body. This class is suitable for beginners and dance enthusiasts, as well as professionals and more advanced dancers who are looking to just vibe and enjoy a fun class!"
  },
  {
    "date": "Thursday, April 10",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Int Adv CONTEMPORARY with Alexa Luke",
    "staff": "Alexa Luke",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Thursday, April 10",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Int Adv THEATER with Ashley Andrews",
    "staff": "Ashley Andrews",
    "room": "Room:Studio 1",
    "instructor": "Ashley Andrews",
    "instructor_bio": "",
    "description": "Ashley's class will begin with a structured warm up focused to aline the body with the mind. This will be followed by the combination which will be rooted in musicality and story telling while engaging in technique. Ashley wants to invite his dancers to have fun, be brave and explore the fullness of their talent in a safe space. \"It takes an athlete to dance, but an artist to be a dancer” - Martha Graham."
  },
  {
    "date": "Thursday, April 10",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Adv Beg VOGUING with Jason A. Rodriguez",
    "staff": "Karma Stylz (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "New Way Vogue is one of 3 styes of voguing.The style is known for voguers showing off contorted and flexible poseswith precision and grace.New Way is an element of vogue that shows mastery in creating lines,shapes, boxes, and face framing to the beat of the music.Classes begins with an ab conditioning series, a stretch series and thenexercises of movement to help understand the dance form.Though students learn through a structure within class, voguing is improvbased. It was created to be a free form of expression.The structure is there to help students explore the dance form but in theend it is to express both freely and confidently."
  },
  {
    "date": "Thursday, April 10",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Int Adv HIP-HOP with Nick Kim",
    "staff": "Jonny Cohen (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Nick Kim’s choreography is a dynamic combination of hip hop foundation and new school style. He has studied under teachers that emphasized the importance of hip hop fundamentals and freestyle as well as instructors who incorporate modern choreography grooves and pictures. His class emphasizes balancing fun and pushing yourself to try new ways to grow. Popping, musicality, and weight changes are important aspects of his choreography and classes."
  },
  {
    "date": "Friday, April 11",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Adv Beg BALLET with Erica Ratkovicz",
    "staff": "June Chin (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Int JUMPS AND TURNS with Harry Francis",
    "staff": "Harry Francis",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training Harry’s ‘Jumps and Turns’ class is a positive, safe space to push and challenge yourself technically and artistically. The warmup incorporates elements of jazz, ballet, yoga and BodyART.After the warmup, there will be a number of pirouette and jump combinations, across the floor.The goal is to have fun and to leave the class feeling amazing, energized and inspired."
  },
  {
    "date": "Friday, April 11",
    "time": "9:15 AM – 10:30 AM EDT",
    "name": "All Levels YOGA FLOW: STRETCH & STRENGTHEN with Alyssa Click",
    "staff": "Alyssa Click",
    "room": "Room:Studio 2",
    "instructor": "Alyssa Click",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/alyssa-click",
    "description": "All Levels Yoga Stretch & Strengthen is a combination of Vinyasa-style yoga including active flows and muscle drills as well as long stretches specifically designed for dancers. This class is directed towards cross training the functional strength and flexibility dancers need to continuously perform at their highest level as they continue to feel strong and confident in their bodies through all kinds of movements. Posture modifications will be offered for all individuals to feel confident on and off their mats."
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg BALLET with Michele Moreno",
    "staff": "Michele Moreno",
    "room": "Room:Studio 1",
    "instructor": "Michele Moreno",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michele-moreno",
    "description": "Michele's beginner ballet class is structured for students with basic ballet knowledge and different dance backgrounds. All exercises are combined to improve control, coordination, musicality, and technique. The 90-minute full ballet class includes barre warmup, turns, jumps, and different combinations at the center and across-the-floor."
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg CONTEMPORARY with Blue",
    "staff": "Blue",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg THEATER with Amanda LaMotte",
    "staff": "Amanda LaMotte",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg TAP with Madison Hilligoss",
    "staff": "Madison Hilligoss",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg HIP-HOP with Paolo Penala",
    "staff": "Paolo Slice Penala",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class begins with a long hip-hop foundational warm up. No matter the level, foundations along with variations will be used to wake up the body, prepare for choreography, and establish building blocks for freestyle. Class will continue by applying the foundations from warm up along with it’s variations to choreography and connection to music. Class is a safe space to grow in movement, vocabulary, and performance quality."
  },
  {
    "date": "Friday, April 11",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Int Adv COLE JAZZ with Cam Loeser",
    "staff": "Cam Loeser",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training A Cole Jazz class offers a training space for dancers looking to develop a more mindful relationship with their technique, hone their artistry, and explore the historic style of Jazz dance pioneer Jack Cole. The class begins with an aerobic warmup that drops the dancer into their breath and sensations from the inside, charging and stretching the body for the work ahead. The class then moves into a center practice that enlist principals from Jack Cole’s pilates informed floor progression, as well as dynamic standing technique and isolation exercises that challenge the dancer to access deeper functionality, coordination, and expansion. We then move into phrase work in the style of Jack Cole that explores dynamic musicality and rhythm, expression, motor skills, and the cultural styles and principles that defined Cole’s idiom and American Jazz Dance. The emphasis of this class is to offer the opportunity for dancers to build a foundational practice and a personal relationship with their craft. It is a space dedicated to helping artists broaden their knowledge and create a deeper understanding of their own bodies. Commitment to consistent training stretches our capacity to take on new, virtuosic work, and opens us up to endless possibilities and discoveries. Most importantly, this is a community space devoted to sharing in the joy of what we do as artists. Come dance!"
  },
  {
    "date": "Friday, April 11",
    "time": "10:45 AM – 12:00 PM EDT",
    "name": "All Levels LASTICS STRETCH TECHNIQUE with Donna Flagg",
    "staff": "Donna Flagg",
    "room": "Room:Studio 2",
    "instructor": "Donna Flagg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/donna-flagg",
    "description": "Lastics Stretch Technique is a stretching technique born from the world of dance that was designed to improve flexibility based on the techniques that dancers use to stay lean and limber. Unlike methods that rely on external force to push a stretch, Lastics trains you to articulate your body in ways that elongate your muscles from the inside.Not only will it change the way you think about and understand your body, you will also increase your flexibility and improve body awareness through a special mind/muscle connection. You'll move, perform and feel better with muscles that are longer, stronger, more supple, and healthy from the inside-out and end-to-end!"
  },
  {
    "date": "Friday, April 11",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Basic TAP with Jill Kenney",
    "staff": "Jill Kenney",
    "room": "Room:Studio B",
    "instructor": "Jill Kenney",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/jill-kenney",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Int Adv CONTEMP JAZZ with Chris Jarosz",
    "staff": "Chris Jarosz",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Friday, April 11",
    "time": "12:00 PM – 1:15 PM EDT",
    "name": "All Levels HIPS AND SPLITS with Donna Flagg",
    "staff": "Donna Flagg",
    "room": "Room:Studio 4",
    "instructor": "Donna Flagg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/donna-flagg",
    "description": "A new class created by Donna Flagg that focuses on the health and balance of dancers’ hips. The first half of the class starts with conditioning and strengthening and is followed by Donna’s splits training, which is grounded in Lastics Stretch Technique principles, and proven highly effective in teaching the proper mechanics of splits while learning how to increase stretch and overall range safely."
  },
  {
    "date": "Friday, April 11",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Adv Beg BALLET with Natalya Stavro",
    "staff": "Natalya Stavro",
    "room": "Room:Studio 1",
    "instructor": "Natalya Stavro",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/natalya-stavro",
    "description": "This class is a fresh and open approach to the study of traditional ballet vocabulary. Emphasis is placed on coordination, placement, flexibility, technique and strength. Musicality is stressed along with a strong sense of performance style. Students in class will move more freely and dance with grace and confidence."
  },
  {
    "date": "Friday, April 11",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg JAZZ FUNK with Chio",
    "staff": "Chio",
    "room": "Room:Studio 5",
    "instructor": "Chio",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/chio",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology. This is a hot jazz class peppered with street, funk, and Hip-Hop. Students should have a basic understanding of the jazz technique. The warm-up is designed to strengthen the students ability to adopt jazz and funk movement."
  },
  {
    "date": "Friday, April 11",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg COMMERCIAL JAZZ with Debbie Wilson",
    "staff": "Debbie Wilson",
    "room": "Room:Studio 3",
    "instructor": "Debbie Wilson",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/debbie-wilson",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Adv Beg HIP-HOP for THEATER TRAINED DANCERS with Ms Vee",
    "staff": "Ms Vee",
    "room": "Room:Studio 2",
    "instructor": "Ms Vee",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/ms-vee",
    "description": "Ever been scared of taking a Hip Hop class because you are a \"kick ball changer\"? Ever felt like \"oh I really need to work on my hip hop....but I can't take THAT class. It's too hard!\" Ever do an audition that is skewing to Hip Hop but you felt uncomfortable in the work? This class is designed for YOU! This class is for musical theatre dancers who have always wanted to get into a Hip Hop class but have been too scared or intimidated to do so. Come learn Hip Hop amongst people who feel exactly the same as you. This will be a safe environment where you'll learn the foundation of groove, technique, and vocabulary of Hip Hop. Everything taught will be directed through the lens of theatre. In that vein, this is a safe space to explore and play in this form of dance that is increasingly being used in Musical Theater work.Level: Adv Beginner - This class assumes you have moderate to extensive training in other forms (ie. Ballet, Jazz, and Theatre) and as such will move at that requisite pace, but focus on fundamentals of Hip Hop. So the material is for a beginner of the art form, but the level and pace of the class and how information is given is not."
  },
  {
    "date": "Friday, April 11",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Adv Beg JAZZ with Sheila Barker",
    "staff": "Sheila Barker",
    "room": "Room:Studio A",
    "instructor": "Sheila Barker",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/sheila-barker",
    "description": "Focus is on breaking down turns, leaps, placement, connecting movement so it flows, and building a dance vocabulary which will bring the dance student to the next level. The class is welcoming to newcomers and Ms. Barker gives individual attention. Her style uses her wide range of influences to create an exciting innovative fusion."
  },
  {
    "date": "Friday, April 11",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg CONTEMPORARY with Michaela McGowan",
    "staff": "Michaela McGowan",
    "room": "Room:Studio 1",
    "instructor": "Michaela McGowan",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michaela-mcgowan",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Int TAP with Jill Kenney",
    "staff": "Jill Kenney",
    "room": "Room:Studio B",
    "instructor": "Jill Kenney",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/jill-kenney",
    "description": "8-10 years training"
  },
  {
    "date": "Friday, April 11",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Basic BALLET with Rose Alice",
    "staff": "Rose Alice",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Beg THEATER with Deanna Doyle",
    "staff": "Cara Leggio (substitute)",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology This class is geared towards the dancer who wants to work on coordination, artistry, strength, technique, vocabulary, and style. We start with a 25-minute progressive, low-intensity warmup, which focuses on getting the body warm, realigned, gently stretched, and ready to move. We then go across the floor for 15 minutes, working on technique such as basic pirouettes and battements. Class culminates with a combo ranging in styles—Billy Joel, Thoroughly Modern Millie, Fred and Ginger, Aretha Frankin, Seven Brides for Seven Brothers, MJ, etc. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Friday, April 11",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Adv Beg HIP-HOP with Geheny Rivera",
    "staff": "Geheny Rivera",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Geheny encourages her students to be versatile movers. There is an emphasis on understanding foundation, grooves, and musicality. She pushes her students to the best of their ability and guides them in using these elements to help develop their own personal movement."
  },
  {
    "date": "Friday, April 11",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Int Adv STREET STYLES with Niki Saludez",
    "staff": "Niki Saludez",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Friday, April 11",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Beg CONTEMPORARY with Eric Campros",
    "staff": "Kathy VanDereedt (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class will begin with a Horton and ballet-based warm-up designed to enhance technique, strength, and alignment. Working across the floor, dancers will learn to more effectively take up space, move with conviction, and instill clarity into their movement. Phrase work will focus on musicality and freedom of movement while maintaining strong technique, all offered in a supportive and positive environment. Eric encourages taking risks, both physical and emotional, to further develop individual style. Dancers will be encouraged to let go of expectations and judgment, allowing their artistry to be their voice."
  },
  {
    "date": "Friday, April 11",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Int Adv JAZZ with Debbie Roshe",
    "staff": "James Gray (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Friday, April 11",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Beg BROADWAY TAP with Deanna Doyle",
    "staff": "Eliah James Furlong (substitute)",
    "room": "Room:Studio B",
    "instructor": "Eliah James Furlong",
    "instructor_bio": "http://broadwaydancecenter.com/faculty/eliah-james-furlong",
    "description": "This class starts with a quick warm-up, followed by 20-30 minutes of across the floor exercises, where we move through the space working on skills such as pullbacks, turns, and progressions that will prepare the brain and body for the combo. We then work on a combo that emphasizes not only tap dancing skills, but also movement quality—think Fred and Ginger meets Gene Kelly meets 42nd Street. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Friday, April 11",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Int BALLET with Eureka Nakano Grimes",
    "staff": "Eureka Nakano Grimes",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training Eurekaʼs ballet class welcomes all ballet lovers. Eurekaʼs class focuses on precise technique, placement and coordination through dancing with intention. All the while, harnessing graceful strength and movement in the mind and body, and fully stretching the self through musicality and artistry. From beginner to pro, she works passionately to support dancers strive for their individual excellence. Sweat and strive with energetic Eureka!"
  },
  {
    "date": "Friday, April 11",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Int Adv STREET JAZZ with Neil Schwartz",
    "staff": "Roy Garzon (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Neil Schwartz’s street jazz class emphasizes musicality, performance, and dynamics, while motivating students to maintain a positive classroom environment. From the warm-up to the class combination, each song is carefully selected to enable each student to focus on body awareness, confidence, and clear execution of movement. Not only will students be challenged physically in the classroom, but also prepared mentally for the outside dance world. This class will encourage students to push past their limits, achieve their desired goals, and know how to have a good time in the process. You never quite know what to expect in class. Come with an open mind, a passion to improve, and the desire to learn more about yourself as an person, artist, and dancer."
  },
  {
    "date": "Friday, April 11",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg HEELS with Yvonne Marie Sain",
    "staff": "Yvonne Marie Sain",
    "room": "Room:Studio 3",
    "instructor": "Yvonne Marie Sain",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/yvonne-marie-sain",
    "description": "This class designed to teach dancers the technique and style of performing in heels. The movement is Street Jazz/Jazz Funk-based with a focus on lines, groove, and feminine sex appeal!"
  },
  {
    "date": "Friday, April 11",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg THEATER with Patrick Garr",
    "staff": "Patrick Garr",
    "room": "Room:Studio 2",
    "instructor": "Patrick Garr",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/patrick-garr",
    "description": "In Patrick’s theatre dance class, students will learn original combinations, while also implementing fundamental technical elements and exploring storytelling through movement. Dancers will be challenged to explore their own artistic strengths in a safe space, while incorporating technical dance repertoire to prepare students for a career in the professional theater and dance industry. All classes begin with a jazz warmup with a modern flare to challenge dancers in areas such as balance, agility, strength and technique, while additionally preparing the body for intense movement. Patrick’s classes derive movement from many styles of dance, training students to develop versatility, storytelling skills, and musicality."
  },
  {
    "date": "Friday, April 11",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg BALLET with Dorit Koppel",
    "staff": "Dorit Koppel",
    "room": "Room:Studio 1",
    "instructor": "Dorit Koppel",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/dorit-koppel",
    "description": "This class is designed for the beginner who has the basic knowledge of Ballet and the ability to do a full and simple barre. Class begins at the barre, covering all the fundamental exercises. From the barre the class moves to the center, where the movement phrases are aimed to develop balance and coordination...students experience the JOY of MOVEMENT through space. Class is suited for students who come from diverse and non-dance backgrounds."
  },
  {
    "date": "Friday, April 11",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg JAZZ FUSION with Michelle Barber",
    "staff": "Alexx Stachowiak (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Michelle’s classes begin with a warm-up designed to get you focused, balanced and ready to dance. Paying attention to technique, strength and breath, the warm-up will guide students in improving their skills as dancers during the combinations. A certified Pilates instructor and yogi, Michelle incorporates this fundamental knowledge of the body into all aspects of her class. Rather than be limited by one style of dance, Michelle prefers to let the music guide her when creating her movement. Her choreography is therefore a fusion of many styles of jazz dance as well as her own brand of movement. With over 30 years of experience, Michelle has developed a style uniquely her own. To see more of her work, follow her on Instagram @michellebarberdance"
  },
  {
    "date": "Friday, April 11",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg HOUSE with Huu Rock",
    "staff": "Huu Rock",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "House is a feeling. In this House Dance class you will learn to feel the music, developing a connection between your movements, the melody and the rhythm. Following a brief warmup, we will break down the fundamentals of House dance: skating, heel toe jack, shuffle and dodge, stomping, the swirl, the train, etc; basic steps that you can take right to the dance floor. Students will then be taught a short routine that stitches it all together. As I always say in my classes: the goal is to have fun, don’t worry about getting it right, just find yourself in the music."
  },
  {
    "date": "Friday, April 11",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "All Levels DANCEHALL with Korie Genius",
    "staff": "Korie Genius",
    "room": "Room:Studio 2",
    "instructor": "Korie Genius",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/korie-genius",
    "description": "This class will offer an introduction to the study of the popular Caribbean dance called Dancehall. Highlights of the course will include a warm up where students will get initiated through various dancehall steps eg. Bogle, Wackey Dip, Peppa Seed, and Butterfly; moves that are consistently called upon to create new dances.This will help students become better acquainted with the different styles of the dance discipline leading them in smooth transition to more technical and complex moves to be learned throughout the class.\nThere will also be a blended learning approach incorporating different genres of reggae (dancehall) music into the weekly routines. Bringing a humorous and comedic way of teaching this class will provide a fun atmosphere for all students"
  },
  {
    "date": "Friday, April 11",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Int CONTEMPORARY with Ali Koinoglou",
    "staff": "Ali Koinoglou",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Using a strong technical foundation, paired with emotionally driven movement, Ali’s contemporary classes are a push for the body & release for the mind. With a fusion of quick accents & technical elements, dancers are challenged to step outside of their comfort zone to expand their range of motion & performance quality. Ali’s goal is to create a safe, inclusive space for all to feel welcome to explore their artistry!"
  },
  {
    "date": "Friday, April 11",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Basic JUMPS AND TURNS with Stacie Webster",
    "staff": "Stacie Webster",
    "room": "Room:Studio 4",
    "instructor": "Stacie Webster",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/stacie-webster",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int JAZZ FUSION with Michelle Barber",
    "staff": "Alexx Stachowiak (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Michelle’s classes begin with a warm-up designed to get you focused, balanced and ready to dance. Paying attention to technique, strength and breath, the warm-up will guide students in improving their skills as dancers during the combinations. A certified Pilates instructor and yogi, Michelle incorporates this fundamental knowledge of the body into all aspects of her class. Rather than be limited by one style of dance, Michelle prefers to let the music guide her when creating her movement. Her choreography is therefore a fusion of many styles of jazz dance as well as her own brand of movement. With over 30 years of experience, Michelle has developed a style uniquely her own. To see more of her work, follow her on Instagram @michellebarberdance"
  },
  {
    "date": "Friday, April 11",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic CONTEMP JAZZ with Stacie Webster",
    "staff": "Stacie Webster",
    "room": "Room:Studio 1",
    "instructor": "Stacie Webster",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/stacie-webster",
    "description": "Stacie's class draws from Contemporary, Jazz, and Modern dance styles with a focus on strengthening and conditioning the body. The class emphasizes technique, artistry, and athleticism."
  },
  {
    "date": "Friday, April 11",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Beg TAP with Mike Camire",
    "staff": "Jessee Leigh Robinson (substitute)",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Friday, April 11",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "All Levels VOICE with Alyssa Click",
    "staff": "Alyssa Click",
    "room": "Room:Studio 4",
    "instructor": "Alyssa Click",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/alyssa-click",
    "description": "Alyssa has been teaching private voice lessons since 2015 to performers of all ages and levels. Most recently, she joined the faculty at Wagner College to help continue training the next generation of performers. Whether you're brand new to singing or you've been at it for years, your voice is a muscle that has to work just like the rest of you! During class, we'll go through a round of warm-ups for your breath and body to support healthy singing, learn a new song for you to put in your audition book, and work in a master-class style to work on your own audition rep and practice performing in front of others. Alyssa's biggest philosophy? There's too much music in the world to sing something you don't like. Let's find something new together!"
  },
  {
    "date": "Friday, April 11",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic STREET JAZZ with Q",
    "staff": "Q",
    "room": "Room:Studio 3",
    "instructor": "Q",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/q",
    "description": "As with all of his classes, Q starts with a stretch and tone warm-up designed to prepare you for a combination that often fuses character and story development with movement that aims to complement the vibe of the varied music chosen for choreography. At least 1-2 years of both Hip-Hop and Jazz is recommended for this class."
  },
  {
    "date": "Friday, April 11",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Int Adv STREET JAZZ with Keenan Cooks",
    "staff": "Keenan Cooks",
    "room": "Room:Studio 5",
    "instructor": "Keenan Cooks",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/keenan-cooks",
    "description": "As a lover of the art of performing, Keenan Cooks' class focuses on enhancing performance quality and dancing beyond the classroom. In each class he pushes students to not only let go and be vulnerable, but to find ways the movement and music relate to situations in their everyday life.Class will start with a warm-up that includes cardio, as well as basic Hip-Hop grooves that can be found throughout Keenan’s choreography. While learning the choreography in class, you will be pushed to incorporate individuality, acting, precision, and musicality. Keenan’s classes are HIGH ENERGY so be ready to sweat!"
  },
  {
    "date": "Friday, April 11",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "All Levels POPPING ANIMATION with Big Mike",
    "staff": "Big Mike",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Saturday, April 12",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic THEATER with Daniel Booda",
    "staff": "Eliah James Furlong (substitute)",
    "room": "Room:Studio 3",
    "instructor": "Eliah James Furlong",
    "instructor_bio": "http://broadwaydancecenter.com/faculty/eliah-james-furlong",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Saturday, April 12",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic BALLET with June Chin",
    "staff": "June Chin",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology From Basic Ballet to Advanced Ballet, class is systematically set up accordingly to the level of class, the students strength, skill, understanding & capability. Emphasis on placement of the body, control, epaulment, artistry & musicality are essential to the students’ training."
  },
  {
    "date": "Saturday, April 12",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg TAP with Mark Albrecht",
    "staff": "Mark Albrecht",
    "room": "Room:Studio B",
    "instructor": "Mark Albrecht",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/mark-albrecht",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Saturday, April 12",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg CONTEMP JAZZ with Ashley Lynne King",
    "staff": "Annie Grove (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Ashley’s jazz classes encourage students of all ages to challenge their minds, bodies, and musicality. Class will begin with a warmup that focuses on alignment, conditioning, and flexibility before transitioning into upbeat combinations across the floor that utilize technique and foundational jazz footwork. Ashley teaches jazz choreography that emphasizes musicality, strength, style, and technique. All are welcome!"
  },
  {
    "date": "Saturday, April 12",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg JAZZ FUSION with Michelle Barber",
    "staff": "Lauryn Johnson (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Michelle’s classes begin with a warm-up designed to get you focused, balanced and ready to dance. Paying attention to technique, strength and breath, the warm-up will guide students in improving their skills as dancers during the combinations. A certified Pilates instructor and yogi, Michelle incorporates this fundamental knowledge of the body into all aspects of her class. Rather than be limited by one style of dance, Michelle prefers to let the music guide her when creating her movement. Her choreography is therefore a fusion of many styles of jazz dance as well as her own brand of movement. With over 30 years of experience, Michelle has developed a style uniquely her own. To see more of her work, follow her on Instagram @michellebarberdance"
  },
  {
    "date": "Saturday, April 12",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg BALLET with Jessica Epting",
    "staff": "Jessica Epting",
    "room": "Room:Studio 1",
    "instructor": "Jessica Epting",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/jessica-epting",
    "description": "The goal of this class is to create and inspire an atmosphere where all dancers can train, perfect, push, and grow. Mrs. Epting is committed to being a part of each dancer’s journey, and she values hard work and attentiveness from each and every class. This class relies on a systematic approach to classical ballet for marked improvement. Dancers will focus on the basics of classical ballet technique, and French ballet terminology, while stressing correct placement, with an added emphasis on performance quality and artistry."
  },
  {
    "date": "Saturday, April 12",
    "time": "1:00 PM – 2:00 PM EDT",
    "name": "All Levels PILATES SCULPT AND TONE with Meg Chizek",
    "staff": "Meg Chizek",
    "room": "Room:Studio 2",
    "instructor": "Meg Chizek",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/meg-chizek",
    "description": "Meg's classes focus on core strengthen and alignment. As a dancer, she loves incorporating musicality into her classes while still honoring correct form.Classes begin with a quick stretch to get into the body and connect to your breath. She will guide you through classical mat Pilates exercises with a focus on core, oblique, and gluteal muscles. She offers advancements and modifications throughout her classes, making it a welcoming environment for all levels.\nWith articulate communication, creative imagery, and exciting music, you are sure to work your body in the most effective and fun way. You will walk away feeling challenged, lengthened, and motivated."
  },
  {
    "date": "Saturday, April 12",
    "time": "1:30 PM – 3:00 PM EDT",
    "name": "Int JAZZ FUSION with Michelle Barber",
    "staff": "Lauryn Johnson (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Michelle’s classes begin with a warm-up designed to get you focused, balanced and ready to dance. Paying attention to technique, strength and breath, the warm-up will guide students in improving their skills as dancers during the combinations. A certified Pilates instructor and yogi, Michelle incorporates this fundamental knowledge of the body into all aspects of her class. Rather than be limited by one style of dance, Michelle prefers to let the music guide her when creating her movement. Her choreography is therefore a fusion of many styles of jazz dance as well as her own brand of movement. With over 30 years of experience, Michelle has developed a style uniquely her own. To see more of her work, follow her on Instagram @michellebarberdance"
  },
  {
    "date": "Saturday, April 12",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Adv Beg JAZZ FUNK with Chio",
    "staff": "TBA (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology This is a hot jazz class peppered with street, funk, and Hip-Hop. Students should have a basic understanding of the jazz technique. The warm-up is designed to strengthen the students ability to adopt jazz and funk movement."
  },
  {
    "date": "Saturday, April 12",
    "time": "3:00 PM – 4:00 PM EDT",
    "name": "All Levels HOLISTIC HEALING YOGA with Renata Bonar",
    "staff": "Renata Bonar",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Embark on a transformative journey of mind, heart, body and soul in the Holistic Healing Yoga class. Renata put together this nurturing practice that weaves the trinity of gentle, therapeutic benefits of RESTORATIVE Yoga, the deep, meditative qualities of YIN Yoga, and the conscious, guided relaxation of Yoga NIDRA."
  },
  {
    "date": "Saturday, April 12",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg HIP-HOP with Q",
    "staff": "Q",
    "room": "Room:Studio 5",
    "instructor": "Q",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/q",
    "description": "The class starts with a warm-up that includes isolations and groove exercises that often figure into the video-style choreography. Routines are often worked on for at least two consecutive classes allowing students to clean, perfect and fine tune the movement. Basic experience is helpful but not necessary; however, the desire to learn is crucial!"
  },
  {
    "date": "Saturday, April 12",
    "time": "4:00 PM – 5:30 PM EDT",
    "name": "Int TAP with Dario Natarelli",
    "staff": "Dario Natarelli",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "We will begin with a nice and easy warm up to prevent injuries and to ensure that our bodies are ready to dance. There will be a combination of several call-and-response exercises to train our ear and overall coordination. This is followed by a technique exercise and then a combination to work on picking up choreography quickly. I make sure that every class has a calm, focused, fun, and non-competitive environment as this is the best way to learn."
  },
  {
    "date": "Saturday, April 12",
    "time": "4:00 PM – 5:30 PM EDT",
    "name": "Int THEATER with Matthew Steffens",
    "staff": "TBA (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training Matt’s class encourages the students to explore storytelling through musicality and performance in a supportive environment. Class begins with stylized jazz/ballet based warmup. Several across-the-floor exercises continue to incorporate technique, syncopation and coordination. Each week, new choreography will be taught that explores the various styles of musical theater, finding a balance between the rich history (Jack Cole, Fosse, Robbins, Bennett, Gower Champion) and the ever changing contemporary landscape (Funk, Hip-Hop, Contemporary, Street Jazz). Students will be challenged to use their own point of view and individuality to tell a story while connecting with an audience…ALL THE WHILE having FUN!"
  },
  {
    "date": "Saturday, April 12",
    "time": "4:00 PM – 5:30 PM EDT",
    "name": "Adv Beg BALLET with Luis Villar",
    "staff": "June Chin (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Luis' Advanced Beginner BALLET Class (L3) includes a 45 min barre focused on musicality, coordination and strengthening. Followed by a 45 min center work exercises combined with turns, small jumps and big jumps. This class will encourage you to find the artistry behind ballet and also to work on your technique no matter what dance background you are coming from."
  },
  {
    "date": "Saturday, April 12",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "All Levels AFRO'DANCE with Angel Kaba",
    "staff": "Shari Piontkowskie (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Afro'Dance class is a mixture of the new generation of African influences and street dance. In the class you will work on musicality heavily influenced by the rhythm and musical trends from The Congo, Ivory Coast, Angola... Urban street styles are incorporated into the backdrop of this heavily African based technique. The cultural, social, and free-spirited side of this class creates an environment where students dance, learn, have fun, and feel free."
  },
  {
    "date": "Saturday, April 12",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Basic TAP with Oren Korenblum",
    "staff": "Oren Korenblum",
    "room": "Room:Studio B",
    "instructor": "Oren Korenblum",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/oren-korenblum",
    "description": "Oren’s tap classes are fun and challenging with exercises that strengthen technique and style and engage your brain. He understands how to break down dynamic combos into teachable sections. Oren starts class by touching on fundamentals of technique and then pushes all his dancers to achieve their next level of success in musical theatre tap! Regardless of your level or past tap experience, Oren will make sure you are challenged. His class is incredibly helpful for musical theatre performers maintaining and improving their tap skills in a safe space."
  },
  {
    "date": "Saturday, April 12",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Beg BALLET with Erica Ratkovicz",
    "staff": "Rose Alice (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Saturday, April 12",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Beg STREET JAZZ with Elodie Dufroux",
    "staff": "Elodie Dufroux",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Elodie’s Street Jazz class is thoughtfully crafted to help students refine their focus on musicality, dynamics, and movement quality. The session begins with a dynamic warm-up that integrates a diverse array of street-based styles, including footwork and foundational hip hop techniques. This approach helps students connect deeply with the music, fostering a sense of grounding and rhythm.The choreography is designed to be both accessible and engaging, providing an environment where students can feel challenged and supported as they grow. Whether you’re a recreational dancer seeking to enjoy the art form or a professional aiming to enhance your commercial dance skills, this class offers the perfect blend of fun and development.Join us to elevate your dance journey and musical expression in a nurturing setting."
  },
  {
    "date": "Saturday, April 12",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg REGGAETON with David Machicado",
    "staff": "David Machicado",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "David's Reggaeton class focuses on developing body control, musicality, and that essential reggaeton groove to commit to the music. He starts his class with a warm up consisting of stretching and getting muscles loose, together with some basic moves to get familiar with the vibe of reggaeton music. Then he will teach a choreography to explore movement in different textures and grooves. In every class he will want you to find yourself in the music and to express it fluently."
  },
  {
    "date": "Saturday, April 12",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Adv Beg TAP with Nicole Billow",
    "staff": "Nicole Billow",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "Steps and Combos - Good for people with 3-5 years of tap but open to anyone. Modifications to increase or decrease difficulty will be given."
  },
  {
    "date": "Saturday, April 12",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Beg JUMPS AND TURNS with Erica Ratkovicz",
    "staff": "Stacie Webster (substitute)",
    "room": "Room:Studio 3",
    "instructor": "Stacie Webster",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/stacie-webster",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Saturday, April 12",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "All Levels BALLET VARIATIONS with Eureka Nakano Grimes",
    "staff": "Eureka Nakano Grimes",
    "room": "",
    "instructor": "",
    "instructor_bio": "",
    "description": "Eurekaʼs ballet class welcomes all ballet lovers. Eurekaʼs class focuses on precise technique, placement and coordination through dancing with intention. All the while, harnessing graceful strength and movement in the mind and body, and fully stretching the self through musicality and artistry. From beginner to pro, she works passionately to support dancers strive for their individual excellence. Sweat and strive with energetic Eureka!"
  },
  {
    "date": "Saturday, April 12",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Int STREET STYLES with Ness Martinez",
    "staff": "Ness Martinez",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Saturday, April 12",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Beg THEATER with Oren Korenblum",
    "staff": "Oren Korenblum",
    "room": "Room:Studio 4",
    "instructor": "Oren Korenblum",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/oren-korenblum",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology In Theatre Jazz class with Oren Korenblum, you’ll work on traditional jazz technique, warm-ups, body strengthening, stamina, rhythm, flexibility, and style.In musical theatre, you must train yourself at every physical level and style while also telling a story.\nOver the past two decades, Oren has performed, choreographed, and taught dance all over the world. He has worked with dancers and movers of all levels and ages, creating a safe space for everyone to do their best in the dance environment.\nThe outcome doesn’t matter. Every class is different because every day in life is different, but showing up for yourself is the greatest success.Judgment and fear are out of the room!Joy and confidence will lead to success, and success means enjoying your time in dance class.\nOren welcomes all artists, at any level of musical theatre, to join him in his class!"
  },
  {
    "date": "Saturday, April 12",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Int Adv CONTEMP FUSION with Courtney Darlington and Alek Palinski",
    "staff": "Courtney Darlington and Alek Palinski",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years of training"
  },
  {
    "date": "Sunday, April 13",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Int LYRICAL with Emily Bufferd",
    "staff": "Emily Bufferd",
    "room": "Room:Studio A",
    "instructor": "Emily Bufferd",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/emily-bufferd",
    "description": "Masks required for this class when Emily is teaching (not required when there is a substitute).8-10 years training\nEmily's classes are a community forum for dancers to explore their potential and grow their abilities in a supportive and empowering environment. A technical warm-up designed to stretch, strengthen, and properly align each dancer enables an easy transition to full bodied movement, and improv that encourages individuality and purposeful choice-making will take place. Class will culminate in choreographed phrase-work that emphasizes quality, intellectualism, personal interpretation, self-expression, and visceral artistic development."
  },
  {
    "date": "Sunday, April 13",
    "time": "9:15 AM – 10:30 AM EDT",
    "name": "All Levels CHAKRA YOGA with Renata Bonar",
    "staff": "Renata Bonar",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Chakra Yoga is a holistic practice program created by Renata that combines physical postures (asanas), breathwork (pranayama), meditation, and sound to balance and align the seven energy centers (chakras) in the body."
  },
  {
    "date": "Sunday, April 13",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg BROADWAY JAZZ with Sue Samuels",
    "staff": "Sue Samuels",
    "room": "Room:Studio A",
    "instructor": "Sue Samuels",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/sue-samuels",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg BALLET with Joy Karley",
    "staff": "Joy Karley",
    "room": "Room:Studio 4",
    "instructor": "Joy Karley",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/joy-karley",
    "description": "* Masks required for this class2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Basic TAP with Mike Camire",
    "staff": "Mike Camire",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg CONTEMPORARY with Stacie Webster",
    "staff": "Stacie Webster",
    "room": "Room:Studio 1",
    "instructor": "Stacie Webster",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/stacie-webster",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "All Levels CARDIO HIP-HOP with LaShawn Jones",
    "staff": "LaShawn Jones",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "This Cardio Hip Hop class includes both fun, follow along movement as well as learning choreography while we live our best lives. After a warm up and foundation review, the first half of class will be dedicated to high energy, follow along dances where you let go and get out your head. Each song will have a different set of moves that repeat a few times boosting your heart rate and stamina. The second half of class will be dedicated to turning on your brain and learning a full routine that we’ll repeat several times. All levels are welcome!"
  },
  {
    "date": "Sunday, April 13",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Int BALLET with Kate Loh",
    "staff": "Adriana Pierce (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Sunday, April 13",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg BROADWAY TAP with Deanna Doyle",
    "staff": "Eliah James Furlong (substitute)",
    "room": "Room:Studio B",
    "instructor": "Eliah James Furlong",
    "instructor_bio": "http://broadwaydancecenter.com/faculty/eliah-james-furlong",
    "description": "This class starts with a quick warm-up, followed by 20-30 minutes of across the floor exercises, where we move through the space working on skills such as pullbacks, turns, and progressions that will prepare the brain and body for the combo. We then work on a combo that emphasizes not only tap dancing skills, but also movement quality—think Fred and Ginger meets Gene Kelly meets 42nd Street. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Sunday, April 13",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Int THEATER with Courtney Darlington",
    "staff": "Courtney Darlington",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Courtney’s class offers a space to focus on artistry, intention, technique, musicality, and nuance. Because of her experience in different realms, class is a blend of commercial, theater, and contemporary making it an environment that welcomes dancers from all backgrounds."
  },
  {
    "date": "Sunday, April 13",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg STREET JAZZ with Carlos Neto",
    "staff": "Eric Jenkins (substitute)",
    "room": "Room:Studio 5",
    "instructor": "Eric Jenkins",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/eric-jenkins",
    "description": "Carlos' classes are known for their highly energetic, fun, and friendly atmosphere. A mix of street dance style foundations including hip-hop, house dance, and locking with an LA choreography-style influence. The result is musically diverse choreography designed to challenge every dancer of every level through the dynamics of movement and body control.Carlos aims to bring out the best of each dancer in every class by insisting on a performance that showcases personality and individuality. This will not only help the student evolve but also equip any dancer with the tools to face the professional world."
  },
  {
    "date": "Sunday, April 13",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Basic JAZZ with Heather Rigg",
    "staff": "Heather Rigg",
    "room": "Room:Studio A",
    "instructor": "Heather Rigg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/heather-rigg",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Adv Beg TAP with Doug Shankman",
    "staff": "Doug Shankman",
    "room": "Room:Studio B",
    "instructor": "Doug Shankman",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/doug-shankman",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg THEATER with Deanna Doyle",
    "staff": "Deanna Doyle",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology This class is geared towards the dancer who wants to work on coordination, artistry, strength, technique, vocabulary, and style. We start with a 25-minute progressive, low-intensity warmup, which focuses on getting the body warm, realigned, gently stretched, and ready to move. We then go across the floor for 15 minutes, working on technique such as basic pirouettes and battements. Class culminates with a combo ranging in styles—Billy Joel, Thoroughly Modern Millie, Fred and Ginger, Aretha Frankin, Seven Brides for Seven Brothers, MJ, etc. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Sunday, April 13",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Adv Beg BALLET with Eureka Nakano Grimes",
    "staff": "Eureka Nakano Grimes",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Beg JAZZ with Heather Rigg",
    "staff": "Heather Rigg",
    "room": "Room:Studio A",
    "instructor": "Heather Rigg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/heather-rigg",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Adv Beg JAZZ FUNK with Chio",
    "staff": "Billy Cohen (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology This is a hot jazz class peppered with street, funk, and Hip-Hop. Students should have a basic understanding of the jazz technique. The warm-up is designed to strengthen the students ability to adopt jazz and funk movement."
  },
  {
    "date": "Sunday, April 13",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Beg CONTEMPORARY with Elodie Dufroux",
    "staff": "Elodie Dufroux",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Elodie’s contemporary class offers a stimulating and motivating experience for students, set within a welcoming and supportive atmosphere. The class begins with a comprehensive warm-up, incorporating conditioning, stretching, and technical exercises to prepare both body and mind.The choreography merges fundamental technical elements with engaging floorwork, ensuring each participant feels both challenged and captivated. Drawing from Elodie’s versatility within several styles, this class is suitable for both recreational students and those aiming to enhance their skills for the commercial dance world. Emphasizing the importance of technique and musicality in the pursuit of personal growth, this class fosters an environment where learning, movement, and mutual enjoyment are paramount."
  },
  {
    "date": "Sunday, April 13",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "All Levels AFROHOUSE with Meka Oku",
    "staff": "Meka Oku",
    "room": "Room:Studio 2",
    "instructor": "Meka Oku",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/meka-oku",
    "description": ""
  },
  {
    "date": "Sunday, April 13",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Basic TAP with Sheila Pomroy",
    "staff": "Sheila Pomroy",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Basic BALLET with Deanna Doyle",
    "staff": "Deanna Doyle",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology This class is geared toward the newer ballet student, the student re-entering ballet class after a hiatus or injury, or anyone wanting to go back to the basics. Focusing on basic technique, turnout, strength, and flexibility, I break down everything in full detail and give advice for different body types. We start with a 45-55 minute barre, followed by center and across the floor work. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Beg JUMPS AND TURNS with Ashley Lynne King",
    "staff": "Kristi Tartaglione (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Basic HIP-HOP with Q",
    "staff": "Q",
    "room": "Room:Studio 5",
    "instructor": "Q",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/q",
    "description": "The class starts with a warm-up that includes isolations and groove exercises that often figure into the video-style choreography. Routines are often worked on for at least two consecutive classes allowing students to clean, perfect and fine tune the movement. Basic experience is helpful but not necessary; however, the desire to learn is crucial!"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg THEATER with Bryan Knowlton",
    "staff": "Bryan Knowlton",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Bryan’s class combines the art of storytelling through various styles of musical theatre with tapping into each dancer’s individual expression. Challenging movement in a safe space, dancers are encouraged to seek their fullest potential via a structured class that consists of full body warm up, body conditioning and combination. Class combinations vary from class to class but always focus on the importance of not only the intent of storytelling through dance but, most importantly, having fun!"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Basic HEELS with Courtney Sauls",
    "staff": "Courtney Sauls",
    "room": "Room:Studio 3",
    "instructor": "Courtney Sauls",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/courtney-sauls",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg CONTEMPORARY with Alex Mitchell",
    "staff": "Alex Mitchell",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class will begin with a full body warm up that includes cardio, conditioning and open stretch. We will move through improvisational exercises, becoming mindful of ourselves and comfortable with those around us. The majority of class is dedicated to learning choreography with the intention of embodying the essence of the music. Focusing on dynamics, the movement vocabulary is a fusion of phrase-work, elements of street styles and theatrical influences"
  },
  {
    "date": "Sunday, April 13",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg TAP with Sheila Pomroy",
    "staff": "Sheila Pomroy",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg BALLET with Luis Villar",
    "staff": "Stefanie Spiece (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Int CONTEMPORARY with Michaela McGowan",
    "staff": "Michaela McGowan",
    "room": "Room:Studio 3",
    "instructor": "Michaela McGowan",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michaela-mcgowan",
    "description": "8-10 years training"
  },
  {
    "date": "Sunday, April 13",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic BALLET with Luis Villar",
    "staff": "Stefanie Spiece (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Luis' ballet class includes a 45 min barre focused on musicality, coordination and strengthening. Followed by a 45 min center work exercises combined with turns, small jumps and big jumps. This class will encourage you to find the artistry behind ballet and also to work on your technique no matter what dance background you are coming from."
  },
  {
    "date": "Sunday, April 13",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int THEATER with Josh Walden",
    "staff": "Josh Walden",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years of training"
  },
  {
    "date": "Sunday, April 13",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Adv Beg JAZZ with Adam Wedesky",
    "staff": "Adam Wedesky",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Sunday, April 13",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Beg CONTEMP with FLOORWORK FUNDAMENTALS with Lorena Cobos",
    "staff": "Lorena Cobos",
    "room": "Room:Studio 3",
    "instructor": "Lorena Cobos",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Adv Beg CONTEMP JAZZ with Ashley Lynne King",
    "staff": "Ashley Lynne King",
    "room": "",
    "instructor": "",
    "instructor_bio": "",
    "description": "Ashley’s jazz classes encourage students of all ages to challenge their minds, bodies, and musicality. Class will begin with a warmup that focuses on alignment, conditioning, and flexibility before transitioning into upbeat combinations across the floor that utilize technique and foundational jazz footwork. Ashley teaches jazz choreography that emphasizes musicality, strength, style, and technique. All are welcome!"
  },
  {
    "date": "Monday, April 14",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic BALLET with Adriana Pierce",
    "staff": "Adriana Pierce",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Adriana's ballet classes are rooted in Balanchine technique, emphasizing coordination, musicality, and movement quality—all of which benefit dancers of any style. She is committed to fostering an inclusive and respectful studio environment, using non-gendered language and promoting a body-positive approach to athleticism."
  },
  {
    "date": "Monday, April 14",
    "time": "9:15 AM – 10:30 AM EDT",
    "name": "All Levels YOGA AND MEDITATION with Lauren Marsaglia",
    "staff": "Lauren Marsaglia",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "At its core, the physical practice of yoga exists to exhaust the body and prepare the mind to mediate: to find a place of stillness and clarity in our inner-being. Dancers will enter this spiritual practice and feel how yoga allows for a deeper sense of acceptance and surrendering to our experiences. With practice, this sensation will bleed into how we reimagine our bodies working for us in dance. The traditional style of Vinyasa yoga initiates from the breath into movement, which can be a transformative experience for the dancer as we begin to move from our parasympathetic nervous system. In the physical body, yoga creates a deeper sense of balance, stability, and body awareness. During practice, modifications are always offered to beginning students. Similarly, more challenging variations are given to those with more experience along their journeys. Ultimately, this class surrounds itself with the idea of transformation and how we can carry our practice off of our mats and into the world!"
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg THEATER with Jason Wise",
    "staff": "Jason Wise",
    "room": "Room:Studio A",
    "instructor": "Jason Wise",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/jason-wise",
    "description": "By focusing on presentation and performance, dancers will deepen their understanding of executing a Broadway production number with precision, style, and flair. They will cultivate essential qualities such as musicality, discipline, and showmanship, effectively showcasing their talents and shining in auditions. This unique experience introduces styles and techniques inspired by legendary pioneers of theatrical dance and emphasizes teamwork and collaboration, mirroring the professional rehearsal process, ultimately offering dancers the skills and confidence needed to thrive as a professional dancer in the Musical Theater."
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg BALLET with Michele Moreno",
    "staff": "Michele Moreno",
    "room": "Room:Studio 1",
    "instructor": "Michele Moreno",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michele-moreno",
    "description": "Michele's beginner ballet class is structured for students with basic ballet knowledge and different dance backgrounds. All exercises are combined to improve control, coordination, musicality, and technique. The 90-minute full ballet class includes barre warmup, turns, jumps, and different combinations at the center and across-the-floor."
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg TAP with Nicole Ohr",
    "staff": "Nicole Ohr",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg HIP-HOP with Paolo Penala",
    "staff": "Hugo Brument Scuderi (substitute)",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class begins with a long hip-hop foundational warm up. No matter the level, foundations along with variations will be used to wake up the body, prepare for choreography, and establish building blocks for freestyle. Class will continue by applying the foundations from warm up along with it’s variations to choreography and connection to music. Class is a safe space to grow in movement, vocabulary, and performance quality."
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Int CONTEMP FUSION with Maleek Washington",
    "staff": "Annie Grove (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Maleek's class focuses on reeducating the body to enhance our human aspects, and creating an atmosphere to be versatile in any given situation. Maleek's movement and combinations range from Contact Improvisation to Contemporary Fusion with a Hip-Hop flare. Students will learn how to tell a vivid story with their body. The class includes a range of structured formatted movement, improvisation, floor work and dynamics centered around making strong movement choices. Maleek leads the class into an investigation of each individual's qualities by integrating acting skills to help dive deeper into a sense of self, and to create well-rounded performers and artists"
  },
  {
    "date": "Monday, April 14",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "All Levels VOGUING with Jason A. Rodriguez",
    "staff": "Jason A. Rodriguez",
    "room": "",
    "instructor": "",
    "instructor_bio": "",
    "description": "New Way Vogue is one of 3 styes of voguing.The style is known for voguers showing off contorted and flexible poseswith precision and grace.New Way is an element of vogue that shows mastery in creating lines,shapes, boxes, and face framing to the beat of the music.Classes begins with an ab conditioning series, a stretch series and thenexercises of movement to help understand the dance form.Though students learn through a structure within class, voguing is improvbased. It was created to be a free form of expression.The structure is there to help students explore the dance form but in theend it is to express both freely and confidently."
  },
  {
    "date": "Monday, April 14",
    "time": "11:00 AM – 12:00 PM EDT",
    "name": "All Levels PILATES with Linda Farrell",
    "staff": "Linda Farrell",
    "room": "Room:Studio 4",
    "instructor": "Linda Farrell",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/linda-farrell",
    "description": "The goal of this class is to stretch and strengthen the entire body with an emphasis on good alignment and developing a strong core base of support. Restores muscle balance, opens tight joints, and ensures structural integration. A must for dancers looking keep their \"dance instrument\" in fine tune; ideal for anyone interested in good posture, long muscles, and proper body alignment!"
  },
  {
    "date": "Monday, April 14",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg CONTEMP LYRICAL with Tracie Stanfield",
    "staff": "Tracie Stanfield",
    "room": "Room:Studio 1",
    "instructor": "Tracie Stanfield",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/tracie-stanfield",
    "description": "Dancers will work on flexibility, strength, range and ease of movement, and building/maintaining technique. Working from a strong center, dancers move through the class finding freedom in the use of torso and limbs, a sense of dynamics and initiation of movement, and a balance of breath and control.Born from a foundation in ballet, the warm-up is created to be a combination of traditional stretching, center barre, and full-bodied movement. The class focuses on allowing each dancer to work to their fullest potential, using technique to allow for efficient and effective communication within the choreography. Whether working in lyrical, contemporary, or traditional jazz combinations, dancers are challenged to become magnetic and confident performers.\nELEMENTS: a leaps, turns, floor work class focusing on strength and technique of leaps and turns, while developing ease of transitions and confidence with floor work. ELEMENTS gives dancers an opportunity to move through the elements of dance and to progress from exercises to choreography.\nClass begins with a warm-up for core strength, body awareness and flexibility. The class moves across the floor with progressions to build skill and understanding of leaps, turns, and floor work. Dancers will learn a short combination of these elements, putting it all together in a seamless and fluid sequence."
  },
  {
    "date": "Monday, April 14",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg TAP with Jill Kenney",
    "staff": "Danielle Jackman (substitute)",
    "room": "Room:Studio B",
    "instructor": "Danielle Jackman",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/danielle-jackman",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "All Levels STRENGTH AND FLEXIBILITY with Kristi Tartaglione",
    "staff": "Kristi Tartaglione",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class is a blend of strength, stretch, and breathwork to find a deeper mind-body connection to help dancers understand the physical and energetic mechanics of the body. Focusing on stability, weight shifts, mobility, active stretch, and recovery. We’ll work to target the muscles that counteract traditional training to keep dancers healthy and supported, throughout their career. Longevity is the name of the game, and this class offers an approach to dance training that marries artistic expression with anatomical expertise."
  },
  {
    "date": "Monday, April 14",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Adv Beg BALLET with Natalya Stavro",
    "staff": "Natalya Stavro",
    "room": "Room:Studio A",
    "instructor": "Natalya Stavro",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/natalya-stavro",
    "description": "This class is a fresh and open approach to the study of traditional ballet vocabulary. Emphasis is placed on coordination, placement, flexibility, technique and strength. Musicality is stressed along with a strong sense of performance style. Students in class will move more freely and dance with grace and confidence."
  },
  {
    "date": "Monday, April 14",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg THEATER with Ian Klein",
    "staff": "Ian Klein",
    "room": "Room:Studio 2",
    "instructor": "Ian Klein",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/ian-klein",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Int JAZZ with Adam Wedesky",
    "staff": "Adam Wedesky",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Monday, April 14",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Basic GRAHAM TECHNIQUE with Tomislav Nevistic",
    "staff": "Tomislav Nevistic",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Monday, April 14",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg JAZZ with Sheila Barker",
    "staff": "Sheila Barker",
    "room": "Room:Studio A",
    "instructor": "Sheila Barker",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/sheila-barker",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Basic TAP with Brent McBeth",
    "staff": "Brent McBeth",
    "room": "Room:Studio B",
    "instructor": "Brent McBeth",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/brent-mcbeth",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Basic BALLET with Erica Ratkovicz",
    "staff": "June Chin (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Int THEATER with Tanner Lane",
    "staff": "Tanner Lane",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Monday, April 14",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Basic HIP-HOP with Geheny Rivera",
    "staff": "Ness Martinez (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Geheny encourages her students to be versatile movers. There is an emphasis on understanding foundation, grooves, and musicality. She pushes her students to the best of their ability and guides them in using these elements to help develop their own personal movement."
  },
  {
    "date": "Monday, April 14",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Int CONTEMPORARY with Jaclyn Walsh",
    "staff": "Jaclyn Walsh",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Monday, April 14",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "All Levels BREAKING with Dr.Ew",
    "staff": "Dr. Ew",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Monday, April 14",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Adv Beg BALLET with Deanna Doyle",
    "staff": "Adriana Pierce (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology This class is geared toward the dancer who wants to continue to hone their technical skills, as well as the working professional dancer in maintenance/recovery mode. Focusing on both technique and artistry, we start with a 35-45 minute barre, move to the center, and leave plenty of time for across the floor. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Monday, April 14",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Beg TAP with Kat Ponza",
    "staff": "Kat Ponza",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class is the logical progression from my Basic Tap class, where we continue to learn and develop a tap technique that will span across a variety of styles and genres. The pace of instruction is faster than in Basic Tap, although there’s still plenty of attention given to breaking down steps and choreography, and understanding proper technique, and the ways in which your body helps your sound and can adapt the technique to mesh with each style/genre of music. As students are expected to have familiarity with basic tap technique already, choreography is more developed than in the Basic class. Still suitable for most beginners, this class may run a little quick for those with little tap experience, who may find the Basic class a more comfortable starting point."
  },
  {
    "date": "Monday, April 14",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Beg CONTEMPORARY with Eric Campros",
    "staff": "Julia Kane (substitute)",
    "room": "Room:Studio 4",
    "instructor": "Julia Kane",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/julia-kane",
    "description": "Class will begin with a Horton and ballet-based warm-up designed to enhance technique, strength, and alignment. Working across the floor, dancers will learn to more effectively take up space, move with conviction, and instill clarity into their movement. Phrase work will focus on musicality and freedom of movement while maintaining strong technique, all offered in a supportive and positive environment. Eric encourages taking risks, both physical and emotional, to further develop individual style. Dancers will be encouraged to let go of expectations and judgment, allowing their artistry to be their voice."
  },
  {
    "date": "Monday, April 14",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Int Adv JAZZ with Debbie Roshe",
    "staff": "James Gray (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Monday, April 14",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Int Adv HIP-HOP with David Thomas",
    "staff": "David Thomas",
    "room": "Room:Studio 5",
    "instructor": "David Thomas",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/david-thomas",
    "description": "This class helps dancers learn a raw style of Hip-Hop and performance. Combining performance, theatrics, and different movements of Hip-Hop, this class gives dancers the confidence to take their skill to the next level.\"Choreography is great but I feel dancers lose what the esscence of dance is, which is expression through movement. If life was a dance, how are you choreographing yours? The goal is not to live forever but to create something that will.\""
  },
  {
    "date": "Monday, April 14",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "All Levels TUTTING with Billy Cohen",
    "staff": "Billy Cohen",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg STREET JAZZ with Bo Belza",
    "staff": "Bo Belza",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Choreography based class with movement influenced from Hip Hop and Jazz. A big focus on dynamic, textures, musicality and performance."
  },
  {
    "date": "Monday, April 14",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg BALLET with Dorit Koppel",
    "staff": "Dorit Koppel",
    "room": "Room:Studio 1",
    "instructor": "Dorit Koppel",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/dorit-koppel",
    "description": "This class is designed for the beginner who has the basic knowledge of Ballet and the ability to do a full and simple barre. Class begins at the barre, covering all the fundamental exercises. From the barre the class moves to the center, where the movement phrases are aimed to develop balance and coordination...students experience the JOY of MOVEMENT through space. Class is suited for students who come from diverse and non-dance backgrounds."
  },
  {
    "date": "Monday, April 14",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Int TAP with Ray Hesselink",
    "staff": "Ray Hesselink",
    "room": "Room:Studio B",
    "instructor": "Ray Hesselink",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/ray-hesselink",
    "description": "8+ years training.Class is fast & geared towards professionals."
  },
  {
    "date": "Monday, April 14",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Int THEATER with Chaz Wolcott",
    "staff": "Chaz Wolcott",
    "room": "Room:Studio A",
    "instructor": "Chaz Wolcott",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/chaz-wolcott",
    "description": "Chaz's theater dance class is the best of both worlds. His warm-up is fun and engaging, while working on technical development, strength, and awareness.There are center exercises that address Jazz technique and most importantly assimilation, helping students prepare for the dreaded complicated dance audition. Chaz's combination focuses more on performance and storytelling then technique, with some technical elements mixed in for variety.\nChaz encourages all dancers to feel good about their work in class, no matter their level or ability. Coming out of class feeling improved is the ultimate goal. Focusing on the story or the message the choreography is trying to convey usually proves to be the missing element in booking jobs in the musical theatre industry, so Chaz tries to give students help and encouragement in that regard!"
  },
  {
    "date": "Monday, April 14",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Adv Beg TURNS AND TECHNIQUE with Ali Koinoglou",
    "staff": "Ali Koinoglou",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "With a focus on sharp accents, powerful dynamics & high-energy, Ali's jazz class will surely get your body moving! Starting with a thorough warm-up, Ali's goal is to have dancers feeling stronger & fulfilled with just the warm up alone, as she prides herself on ensuring dancers are fully prepared for the work that is headed their way. Ali's Jazz combinations work through a plethora of foundational elements, high performance quality performance value & fierce execution of the choreography."
  },
  {
    "date": "Monday, April 14",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Int Adv STREET JAZZ with Kenichi Kasamatsu",
    "staff": "Kenichi Kasamatsu",
    "room": "Room:Studio 5",
    "instructor": "Kenichi Kasamatsu",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/kenichi-kasamatsu",
    "description": "Keen on being clean, Kenichi’s class focuses on clarity through movment; musicality, and textures. This street style class will help dancers excel in picking up choreography mostly in an urban choreography environment and, though some intimidation but may be created from the intricacies, the tension is always broken by the good and warm vibes in class."
  },
  {
    "date": "Monday, April 14",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg CONTEMPORARY with Blue",
    "staff": "Blue",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Monday, April 14",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Beg STREET STYLES with J Lyn",
    "staff": "J Lyn",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "J Lyn’s Hip Hop class is a blend of grooves, foundations, and high-energy choreography to your favorite old school and new school Hip Hop songs. At the end of the her workshop, you will have an understanding of basic Hip Hop technique and terminology. She’ll teach you how to pick up choreography quicker while adding your personal flavor to every step and help you feel more confident with your freestyle."
  },
  {
    "date": "Monday, April 14",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Adv Beg THEATER with Elyn Collier",
    "staff": "Elyn Collier",
    "room": "Room:Studio 1",
    "instructor": "Elyn Collier",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/elyn-collier",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Beg MECHANICS OF TAP with Ja'Bowen Dixon",
    "staff": "Ja'Bowen Dixon",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic BALLET with Sarah Simon Wolff",
    "staff": "Sarah Simon Wolff",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic CONTEMP JAZZ with Stacie Webster",
    "staff": "Stacie Webster",
    "room": "Room:Studio A",
    "instructor": "Stacie Webster",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/stacie-webster",
    "description": "Stacie's class draws from Contemporary, Jazz, and Modern dance styles with a focus on strengthening and conditioning the body. The class emphasizes technique, artistry, and athleticism."
  },
  {
    "date": "Monday, April 14",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Beg COMMERCIAL JAZZ with Debbie Wilson",
    "staff": "Debbie Wilson",
    "room": "Room:Studio 3",
    "instructor": "Debbie Wilson",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/debbie-wilson",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic HIP-HOP with Angel Kaba",
    "staff": "Angel Kaba",
    "room": "Room:Studio 2",
    "instructor": "Angel Kaba",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/angel-kaba",
    "description": "This class will explore the social dance aspect of Hip-Hop focusing on rhythms, foundation, culture, and choreography. The class starts off with a warm-up by stretching out the body, followed by exercises and drills, focusing on groove, musicality, freestyle, and sometimes some history of Hip-Hop culture. The most important aspect of this class is DANCE, learning or relearning how to dance and take a dance class, in opposition to only executing Hip-Hop steps, and choreographies. Angel will support you to focus on yourself, your groove, your musicality, and your ability to move your body. This class is suitable for beginners and dance enthusiasts, as well as professionals and more advanced dancers who are looking to just vibe and enjoy a fun class!"
  },
  {
    "date": "Monday, April 14",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Int Adv STREET JAZZ with Keenan Cooks",
    "staff": "Keenan Cooks",
    "room": "Room:Studio 5",
    "instructor": "Keenan Cooks",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/keenan-cooks",
    "description": "As a lover of the art of performing, Keenan Cooks' class focuses on enhancing performance quality and dancing beyond the classroom. In each class he pushes students to not only let go and be vulnerable, but to find ways the movement and music relate to situations in their everyday life.Class will start with a warm-up that includes cardio, as well as basic Hip-Hop grooves that can be found throughout Keenan’s choreography. While learning the choreography in class, you will be pushed to incorporate individuality, acting, precision, and musicality. Keenan’s classes are HIGH ENERGY so be ready to sweat!"
  },
  {
    "date": "Monday, April 14",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Int CONTEMP FUSION with Camryn Brothers",
    "staff": "Camryn Brothers",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class is designed to allow each student to feel comfortable with their individual artistic voice. We will begin with a warm up that incorporates improvisational exercises to awaken both the body and mind. Choreography is taught with the intention of training the ears as much as the body, paying close attention to musicality. Camryn’s goal is to create an honest and judgement free environment, and have each student leave the classroom feeling full."
  },
  {
    "date": "Monday, April 14",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Basic JAZZ with Cara Leggio",
    "staff": "Cara Leggio",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Cara's classes focus on technique; building strength and coordination, as well as artistry; finding your own unique style and POV.In Jazz class, you will start with light cardio to get the body moving and warm, move through a technical warm up, stretching, and core conditioning, before moving to a turn drill, progressions across the floor, and a short combo to tie everything together. This class is definitely for your inner technician, working to level up your skill and craft. Whether brand new to dance or a professional, this class will both challenge and inspire you to improve your foundation while finding moments of joy celebrating movement!"
  },
  {
    "date": "Monday, April 14",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Beg HEELS with Courtney Sauls",
    "staff": "Courtney Sauls",
    "room": "Room:Studio 3",
    "instructor": "Courtney Sauls",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/courtney-sauls",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Monday, April 14",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "All Levels COMMERCIAL HIP-HOP with Jeffry Amado Hiraldo",
    "staff": "Jeffry Amado Hiraldo",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Hip-hop commercial dance, also known as urban dance, is a style of dancethat is high energy, precise, and rhythmic, and is inspired by streetdance. It is a prominent style of commercial dance, which is a broadcategory of dance that includes many styles, such as hip-hop, jazz. It also astyle of dance that is designed to be performed in front of an audience,such as music videos, concerts, films, musical theater, TV show and so on."
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic THEATER with Melodye Redding",
    "staff": "Trent Soyster (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic CONTEMPORARY with Lorena Cobos",
    "staff": "Lorena Cobos",
    "room": "Room:Studio 4",
    "instructor": "Lorena Cobos",
    "instructor_bio": "",
    "description": "Class usually begins with a cardio (grooves), mobility and technique filled warm-up. Followed by some movement exploration, floorwork exercises, and then a combination that was correlated to the warm up. I am a strong believer in mind muscle connection and like to prepare the body to facilitate the execution of movement given. Together the goal is to create a safe space for self-discovery, storytelling, movement exploration and a fun exchange of energy."
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic BALLET with Cara Leggio",
    "staff": "Cara Leggio",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Cara's ballet classes focus on technique, building strength and coordination, and artistry, finding your own unique style and POV. Dancers have been coming to the barre and practicing these exercises for generations, in this class you can feel like you are coming to this sacred ritual in a safe and encouraging space that celebrates this rich history while making space for the now. Cara’s class will always take you through a full class, from plie to grand allegro. Whether brand new to dance or a professional, this class will both challenge and inspire you to improve your foundation while finding moments of joy celebrating movement!"
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:15 AM – 10:30 AM EDT",
    "name": "All Levels YOGA AND MEDITATION with Lauren Marsaglia",
    "staff": "Lauren Marsaglia",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "At its core, the physical practice of yoga exists to exhaust the body and prepare the mind to mediate: to find a place of stillness and clarity in our inner-being. Dancers will enter this spiritual practice and feel how yoga allows for a deeper sense of acceptance and surrendering to our experiences. With practice, this sensation will bleed into how we reimagine our bodies working for us in dance. The traditional style of Vinyasa yoga initiates from the breath into movement, which can be a transformative experience for the dancer as we begin to move from our parasympathetic nervous system. In the physical body, yoga creates a deeper sense of balance, stability, and body awareness. During practice, modifications are always offered to beginning students. Similarly, more challenging variations are given to those with more experience along their journeys. Ultimately, this class surrounds itself with the idea of transformation and how we can carry our practice off of our mats and into the world!"
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Int JAZZ FUSION with Michelle Barber",
    "staff": "Michelle Barber",
    "room": "Room:Studio 4",
    "instructor": "Michelle Barber",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michelle-barber",
    "description": "Michelle’s classes begin with a warm-up designed to get you focused, balanced and ready to dance. Paying attention to technique, strength and breath, the warm-up will guide students in improving their skills as dancers during the combinations. A certified Pilates instructor and yogi, Michelle incorporates this fundamental knowledge of the body into all aspects of her class. Rather than be limited by one style of dance, Michelle prefers to let the music guide her when creating her movement. Her choreography is therefore a fusion of many styles of jazz dance as well as her own brand of movement. With over 30 years of experience, Michelle has developed a style uniquely her own. To see more of her work, follow her on Instagram @michellebarberdance"
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg CONTEMPORARY with Eric Campros",
    "staff": "Alex Mitchell (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class will begin with a Horton and ballet-based warm-up designed to enhance technique, strength, and alignment. Working across the floor, dancers will learn to more effectively take up space, move with conviction, and instill clarity into their movement. Phrase work will focus on musicality and freedom of movement while maintaining strong technique, all offered in a supportive and positive environment. Eric encourages taking risks, both physical and emotional, to further develop individual style. Dancers will be encouraged to let go of expectations and judgment, allowing their artistry to be their voice."
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg THEATER with Jason Wise",
    "staff": "Jason Wise",
    "room": "Room:Studio 1",
    "instructor": "Jason Wise",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/jason-wise",
    "description": "By focusing on presentation and performance, dancers will deepen their understanding of executing a Broadway production number with precision, style, and flair. They will cultivate essential qualities such as musicality, discipline, and showmanship, effectively showcasing their talents and shining in auditions. This unique experience introduces styles and techniques inspired by legendary pioneers of theatrical dance and emphasizes teamwork and collaboration, mirroring the professional rehearsal process, ultimately offering dancers the skills and confidence needed to thrive as a professional dancer in the Musical Theater."
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg TAP with Dre Torres",
    "staff": "Dre Torres",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg HIP-HOP with Dr.Ew",
    "staff": "Dr. Ew",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg BALLET with Josh Kolberg",
    "staff": "Josh Kolberg",
    "room": "Room:Studio A",
    "instructor": "Josh Kolberg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/josh-kolberg",
    "description": "Josh aims to create an engaging environment where both professional and recreational dancers alike can thrive. He believes that encouragement is the key to allowing dancers to achieve their fullest potential as technicians and artists.A 40 minute barre focuses on proper placement and precise execution followed by center work with an emphasis on musicality and the coordination of timing and movement.\nThis class is a mix of Vaganova, French, and Balanchine technique. Ballet slippers are required and dancers may choose to wear pointe shoes if they like."
  },
  {
    "date": "Tuesday, April 15",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg JUMPS AND TURNS with Blue",
    "staff": "Blue",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg BALLET with Dorit Koppel",
    "staff": "Dorit Koppel",
    "room": "Room:Studio 1",
    "instructor": "Dorit Koppel",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/dorit-koppel",
    "description": "Dorit's class is designed for students who already understand and are able to execute the vocabulary of ballet. Emphasis is placed on proper alignment, correct direction of all movements, and mostly on musicality, phrasing and transitions (connecting one movement to another). This class is not exclusive to ballet dancers; it benefits students who come from diversified dance backgrounds."
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg BROADWAY JAZZ with Sue Samuels",
    "staff": "Sue Samuels",
    "room": "Room:Studio A",
    "instructor": "Sue Samuels",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/sue-samuels",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg TAP with Doug Shankman",
    "staff": "Doug Shankman",
    "room": "Room:Studio B",
    "instructor": "Doug Shankman",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/doug-shankman",
    "description": "Doug believes that the tap artist is both a dancer and musician. Classes are fun, energized, and challenging. Classes will build a strong technique in the fundamental principles of tap dancing."
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg CONTEMP JAZZ with Tracie Stanfield",
    "staff": "Tracie Stanfield",
    "room": "Room:Studio 3",
    "instructor": "Tracie Stanfield",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/tracie-stanfield",
    "description": "Dancers will work on flexibility, strength, range and ease of movement, and building/maintaining technique. Working from a strong center, dancers move through the class finding freedom in the use of torso and limbs, a sense of dynamics and initiation of movement, and a balance of breath and control.Born from a foundation in ballet, the warm-up is created to be a combination of traditional stretching, center barre, and full-bodied movement. The class focuses on allowing each dancer to work to their fullest potential, using technique to allow for efficient and effective communication within the choreography. Whether working in lyrical, contemporary, or traditional jazz combinations, dancers are challenged to become magnetic and confident performers.\nELEMENTS: a leaps, turns, floor work class focusing on strength and technique of leaps and turns, while developing ease of transitions and confidence with floor work. ELEMENTS gives dancers an opportunity to move through the elements of dance and to progress from exercises to choreography.\nClass begins with a warm-up for core strength, body awareness and flexibility. The class moves across the floor with progressions to build skill and understanding of leaps, turns, and floor work. Dancers will learn a short combination of these elements, putting it all together in a seamless and fluid sequence."
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg THEATER with Jennifer Turey",
    "staff": "Jennifer Turey",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Jen’s training and performance experience encompasses a wide range of styles and instructors and she brings that experience to her classes and choreography. Classes will blend exercises in ballet, modern, and jazz to build strength, stamina, body placement and alignment awareness. Progressions across the floor will encourage personal performance choices, confidence, and traveling through space. Combinations will focus on style, musicality, and developing one’s artistic voice. Creating a safe space in which dancers are able to take risks, to find what works individually, to bond as a community, and to let go of expectations is of utmost importance. Dancers are encouraged to be present, work past their maximum, and take pride in their accomplishments."
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg HOUSE with Huu Rock",
    "staff": "Huu Rock",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "House is a feeling. In this House Dance class you will learn to feel the music, developing a connection between your movements, the melody and the rhythm. Following a brief warmup, we will break down the fundamentals of House dance: skating, heel toe jack, shuffle and dodge, stomping, the swirl, the train, etc; basic steps that you can take right to the dance floor. Students will then be taught a short routine that stitches it all together. As I always say in my classes: the goal is to have fun, don’t worry about getting it right, just find yourself in the music."
  },
  {
    "date": "Tuesday, April 15",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Basic HIP-HOP/STREET JAZZ with Hugo Brument",
    "staff": "Hugo Brument Scuderi",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Join Hugo for an energetic and dynamic Street Jazz & Hip-Hop class where he guides you through building strong fundamentals in hip-hop, groove, and various street styles. Hugo’s carefully crafted combos are challenging yet fun, designed to help you refine your musicality using a mix of commercial and hip-hop tracks. With his passion and encouraging teaching style, Hugo ensures a welcoming and supportive atmosphere, so every dancer can feel confident, inspired, and perform their best!"
  },
  {
    "date": "Tuesday, April 15",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Basic BALLET with Dorit Koppel",
    "staff": "Dorit Koppel",
    "room": "Room:Studio 1",
    "instructor": "Dorit Koppel",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/dorit-koppel",
    "description": "\"The foundation for all dance forms.\" This class is designed for the beginner student who wishes to learn and work slowly on the fundamentals of Classical Ballet. Vocabulary will be broken down and emphasis will be placed on understanding proper placement, coordination, musicality and the joy of moving the body in space.Please wear proper attire."
  },
  {
    "date": "Tuesday, April 15",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg JAZZ with Heather Rigg",
    "staff": "Heather Rigg",
    "room": "Room:Studio A",
    "instructor": "Heather Rigg",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/heather-rigg",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "All Levels VOICE with Eric Fotre Leach",
    "staff": "Eric Fotre Leach",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Eric’s philosophy has always been that singing is a lifelong practice. Whether you’re a dancer who’s ready to sing more, or a seasoned professional with roles already under your belt, the art of technique, phrasing, and storytelling through song is a craft that must be maintained. Each of these relaxed (but focused) group classes come in three acts. The first is always an extensive breathing and vocal warmup that stretches and expands both the physical and mental relationship to your voice. The second act is ever changing and trains you on various important music theatre topics like holding harmony, reading music, talking to accompanists, finding and cutting material, musical vocabulary, finding vocal range, and acting through song. And finally the third act of the class will focus on individual’s needs in a ‘masterclass-style’ format. Whether it’s call back material you need to hear with an accompanist or a new song you’ve found you want to try, this time will be evenly distributed for one-on-one attention as others observe and learn in an encouraging atmosphere."
  },
  {
    "date": "Tuesday, April 15",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Int THEATER TAP with Brent McBeth",
    "staff": "Brent McBeth",
    "room": "Room:Studio B",
    "instructor": "Brent McBeth",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/brent-mcbeth",
    "description": "8-10 years training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Int Adv THEATER with Phil Colgan",
    "staff": "Matthew Steffens (substitute)",
    "room": "Room:Studio 3",
    "instructor": "Matthew Steffens",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/matthew-steffens",
    "description": "8-10 years training Phil’s class lives in a cross-section of theatricality, musicality, style/technique, and showmanship. After a jazz-based warm-up structured to engage the body and focus minds, dancers will learn choreography in one of the various styles that musical theater requires of them in the contemporary landscape. Phil aims to help dancers understand how music and its intricacy can inform character and storytelling, all while giving them the space to explore different ways of approaching theater dance—and hopefully having fun on the way."
  },
  {
    "date": "Tuesday, April 15",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Beg HIP-HOP with Ness Martinez",
    "staff": "Ness Martinez",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Int Adv STREET JAZZ with Bo Park",
    "staff": "Bo Park",
    "room": "Room:Studio 5",
    "instructor": "Bo Park",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/bo-park",
    "description": "Bo wants to give everyone a safe place to learn, grow and feel freedom. The class will be focused on learning how to connect with music, developing musicality based on new style with fundamental hip-hop."
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Adv Beg TAP with April Cook",
    "staff": "Funmi Sofola (substitute)",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class is geared towards students with 3-5 years of tap training."
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Adv Beg BALLET with Yuka Kawazu",
    "staff": "Yuka Kawazu",
    "room": "Room:Studio 4",
    "instructor": "Yuka Kawazu",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/yuka-kawazu",
    "description": "This class emphasizes placement, proper classical technique, rhythm and attention to musicality. Students are taught how to improve their instrument through proper barre placement. They are also taught how to move with a strong sense of dynamics. By understanding muscles and placement of their bodies, students refine their technique and learn the subtleties that improve turns, placement, and line."
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Int CONTEMPORARY with Michaela McGowan",
    "staff": "Michaela McGowan",
    "room": "Room:Studio A",
    "instructor": "Michaela McGowan",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michaela-mcgowan",
    "description": "8-10 years training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Int Adv COMMERCIAL JAZZ with Mike Baerga",
    "staff": "Mike Baerga",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years of training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg STREET JAZZ with Neil Schwartz",
    "staff": "Youlmae Kim (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Neil Schwartz’s street jazz class emphasizes musicality, performance, and dynamics, while motivating students to maintain a positive classroom environment. From the warm-up to the class combination, each song is carefully selected to enable each student to focus on body awareness, confidence, and clear execution of movement. Not only will students be challenged physically in the classroom, but also prepared mentally for the outside dance world. This class will encourage students to push past their limits, achieve their desired goals, and know how to have a good time in the process. You never quite know what to expect in class. Come with an open mind, a passion to improve, and the desire to learn more about yourself as an person, artist, and dancer."
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Beg THEATER with Marjorie Failoni",
    "staff": "Amanda LaMotte (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "All Levels ACRO with Sissa Strain",
    "staff": "Sissa Strain",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Sissa’s acro class is structured with a full body warm up, center exercises, and repeating passes across a tumbling mat. Students will work on balance skills, limbering, and power tumbling preparation focusing on strength, flexibility, and dexterity. As an open level class, students will be given individualized skills appropriate for their level and are encouraged to work at their own pace. Sissa Strain is certified 10+ years to teach acrobatics and tumbling by Dance Masters of America."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Adv Beg TAP with Ray Hesselink",
    "staff": "Ray Hesselink",
    "room": "Room:Studio B",
    "instructor": "Ray Hesselink",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/ray-hesselink",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg BALLET with Deanna Doyle",
    "staff": "Deanna Doyle",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Deanna's classes focus on both technique and artistry. Proper placement and precise execution of steps are emphasized, as well as the freedom to enjoy the artistry of dance. Deanna creates a safe and welcoming environment for students of all paths, whether they are brushing up on the basics, maintaining their technique, or pursuing ballet as an artistic outlet."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Adv Beg CONTEMP JAZZ with Nijawwon Matthews",
    "staff": "Nijawwon Matthews",
    "room": "Room:Studio A",
    "instructor": "Nijawwon Matthews",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/nijawwon-matthews",
    "description": "Mr. Matthews strives to develop a ritual of intent which encourages exploration and the research of artistic and humanistic expression. This is called the Nijawwon Transitional Method— NTM is charged with an emotional, spiritual, and physical quality to convey confidence and seamless transitional movement to the artists. It encompasses the use of dynamics, textures, and spatial level changes with serpentine fluidity. It is the use of circulation, undulation, and spiral. This allows artists to use their entire body as they continually move through space and weight exchange. As we go across the floor; dancers get the chance to have a structured improv that allows for storytelling, musicality, and athletic movement that start from an intuitive and internal place that then transitions externally and expressively. Finally, Matthews ends with combinations that challenges the dancers to become more informed performers and free themselves from self doubt. Mr. Matthews gives students love, encouragement, and the confidence to trust themselves in the safe space he provides for each artist."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Int Adv JAZZ with Robyn Williams",
    "staff": "Robyn Williams",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Robyn Williams' jazz class combines the elements and technique of jazz dance with the focus on performance quality for the TV, film, commercials and camera. With her background spanning across many industry spaces, she looks forward to encouraging the natural star quality in all dancers while honing in on technique and movement quality for versatility in all dance spaces."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg JAZZ FUNK with Miles Keeney",
    "staff": "Miles Keeney",
    "room": "Room:Studio 5",
    "instructor": "Miles Keeney",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/miles-keeney",
    "description": "In each class, Miles aims to bring out the absolute best in every student. He's developed a unique Jazz Funk genre that pulls from his training primarily in hip-hop, jazz, contemporary, and modern. His classes cover the full scope of commercial dance and give dancers the necessary tools to maintain their individuality while working in both the context of the choreography, and the industry. His classes focus on performance beyond the classroom and dancers visualizing themselves in their dream dance setting. Students leave class feeling like they have channeled their inner superstars and have tapped into a higher level of performance quality.Class begins with a thorough warmup with isolations, grooves, core work, and jazz-based drills. Then a combination is taught and broken down before ample time is left to execute and perform the choreography."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Adv Beg THEATER with Brandon Kelly",
    "staff": "Brandon Kelly",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology Brandon cultivates a space of inclusion, inspiration, and empowerment. Class begins with a warm-up that combines technique, strength-building, and dynamics. Followed by progressions that focus on expanding the performer’s range of movement. A final combo encourages storytelling with musicality, elevating students’ confidence, style, and energy."
  },
  {
    "date": "Tuesday, April 15",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Beg STREET STYLES/HIP-HOP with AntBoogie",
    "staff": "Marley Lubin (substitute)",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class will give you the elements you need to perform on stage. The focus of class is to bring your dancing IQ to a higher level. You will work on choreography, musicality, and your ability to perform. This class will clean your movements, correct bad habits, all while learning fun and energetic routines."
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int CONTEMPORARY with Jaclyn Walsh",
    "staff": "Jaclyn Walsh",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic TAP with Shelby Kaufman",
    "staff": "Shelby Kaufman",
    "room": "Room:Studio B",
    "instructor": "Shelby Kaufman",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/shelby-kaufman",
    "description": "Shelby's tap classes are based in technique, with a strong focus on rhythm and musicality. Classes include warm-ups, center floor exercises, progressions across the floor, and combinations varying greatly in style and genre of music. Shelby always provides individual attention and instruction to each dancer and and attempts to create a nonjudgmental and positive environment in every class."
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Basic BALLET with Sarah Simon Wolff",
    "staff": "Sarah Simon Wolff",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int JAZZ with Dylan Pearce",
    "staff": "Dylan Pearce",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:00 PM – 9:00 PM EDT",
    "name": "BDC Inspire: All Levels TV REP/COMMERCIAL JAZZ with Kat Burns",
    "staff": "Kat Burns",
    "room": "Room:Studio 5",
    "instructor": "Kat Burns",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/kathryn-burns",
    "description": "BDC Inspire: All Levels TV REP/COMMERCIAL JAZZ with Kat Burns\nEach student must register and pay individually.There are NO refunds or exchanges for this guest class.This Guest Class is for Ages 13+$30 pre-registration required\nStudent must be present at the start of class time, or your class will be forfeited."
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "All Levels AFRO DANCE CLASS with Judith McCarty",
    "staff": "Judith McCarty",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class is built to introduce you to the varied styles that lie in Afro dance through training drills and choreography from sbujway, ndombolo, Azonto, kuduro, and many more African street dance styles. Judith will touch on a different country every class to give you a full understanding on the different flavors in Afro dance. It is open to all levels of dancers; everyone is welcome!"
  },
  {
    "date": "Tuesday, April 15",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Adv Beg HEELS with Hector Lopez",
    "staff": "Hector Lopez",
    "room": "Room:Studio 3",
    "instructor": "Hector Lopez",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/hector-lopez",
    "description": "Hector works to establish an environment in which students are building a strong technical foundation and claiming ownership of the information. In doing so, they are able to apply the technique when working and learning other styles.Heels do not only physically elevate you, they instill a sense of power and authority. As an educator, Hector strives to empower his students to fearlessly be themselves rather than assume an alter ego."
  },
  {
    "date": "Tuesday, April 15",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Int CONTEMP FUSION with Maleek Washington",
    "staff": "Maleek Washington",
    "room": "Room:Studio A",
    "instructor": "Maleek Washington",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/maleek-washington",
    "description": "Maleek's class focuses on reeducating the body to enhance our human aspects, and creating an atmosphere to be versatile in any given situation. Maleek's movement and combinations range from Contact Improvisation to Contemporary Fusion with a Hip-Hop flare. Students will learn how to tell a vivid story with their body. The class includes a range of structured formatted movement, improvisation, floor work and dynamics centered around making strong movement choices. Maleek leads the class into an investigation of each individual's qualities by integrating acting skills to help dive deeper into a sense of self, and to create well-rounded performers and artists"
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "All Levels CABARET BURLESQUE with Nathalie Marrable",
    "staff": "Sarah Tracy (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Nathalie's Burlesque class is inspired by Parisian cabarets such as Lido and Crazy Horse. Using her experience as a solo burlesque act in Europe, Nathalie teaches the unique and classy art of striptease. Warmup includes showgirl walks, getting comfortable with lyrical floor work, and using props such as gloves and chairs. Choreography is usually theatrical as students are encouraged to create \"their own show\". There are no wrong choices, only solos! This is a safe and empowering environment in which to experiment with the art of stylized striptease. Bring an oversized button down shirt and dress in whatever makes you feel fabulous. Heels are recommended. Class is appropriate for those with or without dance experience and gender-inclusive. Everyone is welcome!"
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Int Adv HIP-HOP with Deshawn Da Prince",
    "staff": "TBA (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Tuesday, April 15",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "All Levels REGGAETON with Jonathan \"Shwing\" Pena",
    "staff": "Jonathan \"Shwing\" Pena",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Reggaeton fuses elements and accents of Dancehall, Afro and Hiphop to produce complex and intricate latin combinations that highlight commercial, latin trap, and fusion which all fall under the umbrella of the Urban Latin Industry."
  },
  {
    "date": "Wednesday, April 16",
    "time": "9:00 AM – 10:30 AM EDT",
    "name": "Basic BALLET with Adriana Pierce",
    "staff": "Adriana Pierce",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "Adriana's ballet classes are rooted in Balanchine technique, emphasizing coordination, musicality, and movement quality—all of which benefit dancers of any style. She is committed to fostering an inclusive and respectful studio environment, using non-gendered language and promoting a body-positive approach to athleticism."
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Beg BALLET with Michele Moreno",
    "staff": "Michele Moreno",
    "room": "Room:Studio 1",
    "instructor": "Michele Moreno",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michele-moreno",
    "description": "Michele's beginner ballet class is structured for students with basic ballet knowledge and different dance backgrounds. All exercises are combined to improve control, coordination, musicality, and technique. The 90-minute full ballet class includes barre warmup, turns, jumps, and different combinations at the center and across-the-floor."
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Basic THEATER with Melodye Redding",
    "staff": "Sarah Crane (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg HIP-HOP with Paolo Penala",
    "staff": "Paolo Slice Penala",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class begins with a long hip-hop foundational warm up. No matter the level, foundations along with variations will be used to wake up the body, prepare for choreography, and establish building blocks for freestyle. Class will continue by applying the foundations from warm up along with it’s variations to choreography and connection to music. Class is a safe space to grow in movement, vocabulary, and performance quality."
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Adv Beg TAP with Dre Torres",
    "staff": "Dre Torres",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "Int CONTEMP FUSION with Maleek Washington",
    "staff": "Michaela McGowan (substitute)",
    "room": "Room:Studio A",
    "instructor": "Michaela McGowan",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/michaela-mcgowan",
    "description": "Maleek's class focuses on reeducating the body to enhance our human aspects, and creating an atmosphere to be versatile in any given situation. Maleek's movement and combinations range from Contact Improvisation to Contemporary Fusion with a Hip-Hop flare. Students will learn how to tell a vivid story with their body. The class includes a range of structured formatted movement, improvisation, floor work and dynamics centered around making strong movement choices. Maleek leads the class into an investigation of each individual's qualities by integrating acting skills to help dive deeper into a sense of self, and to create well-rounded performers and artists"
  },
  {
    "date": "Wednesday, April 16",
    "time": "10:30 AM – 12:00 PM EDT",
    "name": "All Levels STRENGTH AND FLEXIBILITY with Kristi Tartaglione",
    "staff": "Kristi Tartaglione",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class is a blend of strength, stretch, and breathwork to find a deeper mind-body connection to help dancers understand the physical and energetic mechanics of the body. Focusing on stability, weight shifts, mobility, active stretch, and recovery. We’ll work to target the muscles that counteract traditional training to keep dancers healthy and supported, throughout their career. Longevity is the name of the game, and this class offers an approach to dance training that marries artistic expression with anatomical expertise."
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Adv Beg CONTEMP LYRICAL with Tracie Stanfield",
    "staff": "Tracie Stanfield",
    "room": "Room:Studio A",
    "instructor": "Tracie Stanfield",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/tracie-stanfield",
    "description": "Dancers will work on flexibility, strength, range and ease of movement, and building/maintaining technique. Working from a strong center, dancers move through the class finding freedom in the use of torso and limbs, a sense of dynamics and initiation of movement, and a balance of breath and control.Born from a foundation in ballet, the warm-up is created to be a combination of traditional stretching, center barre, and full-bodied movement. The class focuses on allowing each dancer to work to their fullest potential, using technique to allow for efficient and effective communication within the choreography. Whether working in lyrical, contemporary, or traditional jazz combinations, dancers are challenged to become magnetic and confident performers.\nELEMENTS: a leaps, turns, floor work class focusing on strength and technique of leaps and turns, while developing ease of transitions and confidence with floor work. ELEMENTS gives dancers an opportunity to move through the elements of dance and to progress from exercises to choreography.\nClass begins with a warm-up for core strength, body awareness and flexibility. The class moves across the floor with progressions to build skill and understanding of leaps, turns, and floor work. Dancers will learn a short combination of these elements, putting it all together in a seamless and fluid sequence."
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Beg THEATER TAP with Doug Shankman",
    "staff": "Danielle Jackman (substitute)",
    "room": "Room:Studio B",
    "instructor": "Danielle Jackman",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/danielle-jackman",
    "description": "Doug believes that the tap artist is both a dancer and musician. Classes are fun, energized, and challenging. Classes will build a strong technique in the fundamental principles of tap dancing."
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:00 PM – 1:30 PM EDT",
    "name": "Int Adv JAZZ with Dougie Robbins",
    "staff": "Dougie Robbins",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years of trianing"
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Adv Beg BALLET with Natalya Stavro",
    "staff": "Natalya Stavro",
    "room": "Room:Studio 1",
    "instructor": "Natalya Stavro",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/natalya-stavro",
    "description": "This class is a fresh and open approach to the study of traditional ballet vocabulary. Emphasis is placed on coordination, placement, flexibility, technique and strength. Musicality is stressed along with a strong sense of performance style. Students in class will move more freely and dance with grace and confidence."
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg JAZZ FUNK with Chio",
    "staff": "Chio",
    "room": "Room:Studio 5",
    "instructor": "Chio",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/chio",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology. This is a hot jazz class peppered with street, funk, and Hip-Hop. Students should have a basic understanding of the jazz technique. The warm-up is designed to strengthen the students ability to adopt jazz and funk movement."
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Adv Beg THEATER with Ian Klein",
    "staff": "Ian Klein",
    "room": "Room:Studio 2",
    "instructor": "Ian Klein",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/ian-klein",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Beg HEELS with Mishay Petronelli",
    "staff": "Mishay Petronelli",
    "room": "",
    "instructor": "",
    "instructor_bio": "",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "12:15 PM – 1:45 PM EDT",
    "name": "Int Adv HEELS with The Melendres Twins",
    "staff": "Melendres Twins",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "This heels class is geared toward the intermediate / advanced dancer while offering a fun and supportive environment to elevate your skills and performance. Heels dance classes are designed to teach the art of dancing in high heels while focusing on strength, confidence, and sensuality. Students will learn about the technique of heels dancing, across the floor combinations, as well as choreography."
  },
  {
    "date": "Wednesday, April 16",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg BALLET with Deanna Doyle",
    "staff": "Cara Leggio (substitute)",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "Deanna's classes focus on both technique and artistry. Proper placement and precise execution of steps are emphasized, as well as the freedom to enjoy the artistry of dance. Deanna creates a safe and welcoming environment for students of all paths, whether they are brushing up on the basics, maintaining their technique, or pursuing ballet as an artistic outlet."
  },
  {
    "date": "Wednesday, April 16",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Beg JUMPS AND TURNS with Eric Campros",
    "staff": "Tracie Stanfield (substitute)",
    "room": "Room:Studio A",
    "instructor": "Tracie Stanfield",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/tracie-stanfield",
    "description": "2-5 years trainingBasic understanding of discipline and general dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Int TAP with Sydney Burtis",
    "staff": "Sydney Burtis",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": "I strive to make my classes a safe place for exploration, discovery, and growth. We dive into our individual relationships to sound and movement, while continuing to honor the tap dance masters. I always begin class with a thorough warm up, introducing our bodies to a multitude of tap dance techniques. Immediately following, we will move through a couple of exercises ranging between technique drills, across the floor combinations, improvisation, musicality training, and/or hands and feet coordination. To finish, I will share a piece of choreography that encompasses everything we worked on. Here, dancers are encouraged not only to grasp the tap dance technique and rhythmic structure to the best of their abilities, but to also explore their approach to the floor, and how their bodies move through space. I absolutely love teaching at Broadway Dance Center, and hope you join me in the studio soon!"
  },
  {
    "date": "Wednesday, April 16",
    "time": "1:45 PM – 3:15 PM EDT",
    "name": "Int THEATER with Tanner Lane",
    "staff": "Tanner Lane",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Wednesday, April 16",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Basic HIP-HOP with Geheny Rivera",
    "staff": "Ness Martinez (substitute)",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "Geheny encourages her students to be versatile movers. There is an emphasis on understanding foundation, grooves, and musicality. She pushes her students to the best of their ability and guides them in using these elements to help develop their own personal movement."
  },
  {
    "date": "Wednesday, April 16",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Beg CONTEMPORARY with Alex Mitchell",
    "staff": "Alex Mitchell",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class will begin with a full body warm up that includes cardio, conditioning and open stretch. We will move through improvisational exercises, becoming mindful of ourselves and comfortable with those around us. The majority of class is dedicated to learning choreography with the intention of embodying the essence of the music. Focusing on dynamics, the movement vocabulary is a fusion of phrase-work, elements of street styles and theatrical influences"
  },
  {
    "date": "Wednesday, April 16",
    "time": "2:00 PM – 3:30 PM EDT",
    "name": "Adv STREET JAZZ with Bo Park",
    "staff": "Andrew Solis (substitute)",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Bo wants to give everyone a safe place to learn, grow and feel freedom. The class will be focused on learning how to connect with music, developing musicality based on new style with fundamental hip-hop."
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Adv Beg JAZZ with Sheila Barker",
    "staff": "Sheila Barker",
    "room": "Room:Studio 1",
    "instructor": "Sheila Barker",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/sheila-barker",
    "description": "Focus is on breaking down turns, leaps, placement, connecting movement so it flows, and building a dance vocabulary which will bring the dance student to the next level. The class is welcoming to newcomers and Ms. Barker gives individual attention. Her style uses her wide range of influences to create an exciting innovative fusion."
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Basic BALLET with Deanna Doyle",
    "staff": "Cara Leggio (substitute)",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "1-2 years trainingSome prior knowledge of dance terminology This class is geared toward the newer ballet student, the student re-entering ballet class after a hiatus or injury, or anyone wanting to go back to the basics. Focusing on basic technique, turnout, strength, and flexibility, I break down everything in full detail and give advice for different body types. We start with a 45-55 minute barre, followed by center and across the floor work. My class is a very warm, welcoming environment, one of encouragement and humor!"
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:30 PM – 5:00 PM EDT",
    "name": "Adv Beg TAP with Brent McBeth",
    "staff": "Brent McBeth",
    "room": "Room:Studio B",
    "instructor": "Brent McBeth",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/brent-mcbeth",
    "description": "5-8 years trainingComplete understanding and proficiency in discipline and general dance terminology"
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Int CONTEMP FUSION with Camryn Brothers",
    "staff": "Camryn Brothers",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "Class is designed to allow each student to feel comfortable with their individual artistic voice. We will begin with a warm up that incorporates improvisational exercises to awaken both the body and mind. Choreography is taught with the intention of training the ears as much as the body, paying close attention to musicality. Camryn’s goal is to create an honest and judgement free environment, and have each student leave the classroom feeling full."
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "All Levels RESTORATIVE MEDITATION with Sarah Simon Wolf",
    "staff": "Sarah Simon Wolff",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "This is a combination recovery class including 30 minutes of restorative exercises to mitigate tightness and calibrate alignment followed by a 45 minute guided meditation. The type of meditation is called Yoga Nidra, which loosely translates to \"waking rest\" or \"conscious sleep\" and is practised in savasana on a mat. Yoga Nidra yields a state of deep relaxation through an introspective body scan while holding space for the ever changing experiences in our bodies, minds, and emotions. The science of this practice proves rapid cellular repair, reduced stress and anxiety, improved sleep, increased clarity of mind, and expedient physical recovery. It is a superb modality for dancers, athletes, and performers to recharge and prepare for the physical and mental demands of the industry and artform. One completes the practice feeling rested, recharged, calm, and at ease."
  },
  {
    "date": "Wednesday, April 16",
    "time": "3:45 PM – 5:15 PM EDT",
    "name": "Adv Beg THEATER with Daniel Gold",
    "staff": "Daniel Gold",
    "room": "Room:Studio 3",
    "instructor": "Daniel Gold",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/daniel-gold",
    "description": "Daniel's class is a place for dancers to grow as technicians and performers. The class begins with a warm up and series of across the floor exercises. These exercises will touch upon the dancers' base technique to properly engage their body and mind. Next, Daniel will teach a class combination which he designs to improve the dancer's ability to add their own finesse to their performance. His focus on technical and performance qualities in a welcoming environment will have students feeling more confident and ready to take these skills to their next audition."
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg BALLET with Dorit Koppel",
    "staff": "Dorit Koppel",
    "room": "Room:Studio 1",
    "instructor": "Dorit Koppel",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/dorit-koppel",
    "description": "This class is designed for the beginner who has the basic knowledge of Ballet and the ability to do a full and simple barre. Class begins at the barre, covering all the fundamental exercises. From the barre the class moves to the center, where the movement phrases are aimed to develop balance and coordination...students experience the JOY of MOVEMENT through space. Class is suited for students who come from diverse and non-dance backgrounds."
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Int TAP with Ray Hesselink",
    "staff": "Ray Hesselink",
    "room": "Room:Studio B",
    "instructor": "Ray Hesselink",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/ray-hesselink",
    "description": "8+ years training.Class is fast & geared towards professionals."
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Adv Beg CONTEMP JAZZ with Julia Kane",
    "staff": "Julia Kane",
    "room": "Room:Studio 4",
    "instructor": "Julia Kane",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/julia-kane",
    "description": "Julia’s class begins with a structured, progressive warm up that emphasizes technique and flexibilty. Following warmup, class moves into choreography that is dynamic and energized - be prepared to get moving, and to let that tension go! Julia's choreography emphasizes moving with a freeness of the upper body, specifically focusing on the fluidity of the head, neck, and spine. Her style incorporates classic jazz techniques and lines with more contemporary based movement and release."
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:15 PM – 6:45 PM EDT",
    "name": "Beg THEATER with Avital Asuleen",
    "staff": "Avital Asuleen",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "Avital's theater dance classes feature combinations inspired by both classic and contemporary musical theater choreographers. The class begins with a set warm-up focusing on technique and alignment. Class always includes across the floor progressions and culminates with a combination set to an original cast recording. Avital provides both modifications and advancements throughout the class in order to accomodate dancers with varying levels of experience. Avital is also a certified Giordano Jazz instructor through the Nan Giordano Certification Program, and often incorporates elements of that technique into her classes."
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Int Adv HIP-HOP with David Thomas",
    "staff": "Parth Sethi (substitute)",
    "room": "Room:Studio 5",
    "instructor": "Parth Sethi",
    "instructor_bio": "https://broadwaydancecenter.com/faculty/parth-sethi",
    "description": "This class helps dancers learn a raw style of Hip-Hop and performance. Combining performance, theatrics, and different movements of Hip-Hop, this class gives dancers the confidence to take their skill to the next level.\"Choreography is great but I feel dancers lose what the esscence of dance is, which is expression through movement. If life was a dance, how are you choreographing yours? The goal is not to live forever but to create something that will.\""
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "Beg HIP-HOP FOUNDATIONS with Ms Vee",
    "staff": "Ms Vee",
    "room": "Room:Studio 3",
    "instructor": "Ms Vee",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/ms-vee",
    "description": "This class focuses on the foundation of Hip Hop dance - all the grooves, vocabulary, techniques, and history that make Hip Hop what it is. Whether you are a beginner or an advanced dancer, there is a place for everyone in this class, because everyone needs foundation! The aim of this class is to connect the dots between the origins of this dance (ie. the FLAVA!) and choreography based work.Class structure:50min Warm Up filled with grooves, dynamic stretching, core work, and technique and vocab10-20min of Technique breakdown and drilling of 1-3 things20-30min of a short phrase where the techniques that were just practiced are applied in choreography*Underage dancers welcomed"
  },
  {
    "date": "Wednesday, April 16",
    "time": "5:30 PM – 7:00 PM EDT",
    "name": "All Levels HEELS FOUNDATIONS AND FREESTYLE with Sissa Strain",
    "staff": "Sissa Strain",
    "room": "Room:Studio 2",
    "instructor": "",
    "instructor_bio": "",
    "description": "Sissa’s heels foundations and freestyle class focuses on alignment, traveling, freestyle, and performance. Both commercial and theatrical heel footwear are welcome. Class begins with a barefoot warm up followed by center technique exercises in heels. Dancers work across the floor exploring footwork, floor work, and spatial awareness. Class incorporates freestyle exercises that elevate dancers’ musicality, confidence, and personal style. Class is high-energy, detailed, and technical, with an overall emphasis on individual artistry and community."
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int Adv THEATER with Josh Assor",
    "staff": "Josh Assor",
    "room": "Room:Studio 1",
    "instructor": "Josh Assor",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/josh-assor",
    "description": "Josh's class draws influences from many different styles and genres of dance. This class will train dancers to develop versatility, control, story-telling and athleticism. Class will begin with a thorough technique-based warm up working towards gaining strength, flexibility and core connection. Dancers will then learn a combination where they can perfect their sense of musicality, artistry and personal style. Students will be challenged in a welcoming and positive environment preparing each individual dancer for a career in the dance and theater industry."
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int Adv CONTEMP JAZZ with Nijawwon Matthews",
    "staff": "Nijawwon Matthews",
    "room": "Room:Studio A",
    "instructor": "Nijawwon Matthews",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/nijawwon-matthews",
    "description": "Mr. Matthews strives to develop a ritual of intent which encourages exploration and the research of artistic and humanistic expression. This is called the Nijawwon Transitional Method— NTM is charged with an emotional, spiritual, and physical quality to convey confidence and seamless transitional movement to the artists. It encompasses the use of dynamics, textures, and spatial level changes with serpentine fluidity. It is the use of circulation, undulation, and spiral. This allows artists to use their entire body as they continually move through space and weight exchange. As we go across the floor; dancers get the chance to have a structured improv that allows for storytelling, musicality, and athletic movement that start from an intuitive and internal place that then transitions externally and expressively. Finally, Matthews ends with combinations that challenges the dancers to become more informed performers and free themselves from self doubt. Mr. Matthews gives students love, encouragement, and the confidence to trust themselves in the safe space he provides for each artist."
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int LATIN JAZZ with Fernando Naranjo",
    "staff": "Fernando Naranjo",
    "room": "Room:Studio 4",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years training"
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:00 PM – 8:30 PM EDT",
    "name": "Int Adv TAP with Gwen Potter",
    "staff": "Mike Camire (substitute)",
    "room": "Room:Studio B",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic HIP-HOP with Q",
    "staff": "Q",
    "room": "Room:Studio 5",
    "instructor": "Q",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/q",
    "description": "The class starts with a warm-up that includes isolations and groove exercises that often figure into the video-style choreography. Routines are often worked on for at least two consecutive classes allowing students to clean, perfect and fine tune the movement. Basic experience is helpful but not necessary; however, the desire to learn is crucial!"
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "All Levels FEMININE COMMERCIAL with Debbie Wilson",
    "staff": "Debbie Wilson",
    "room": "Room:Studio 3",
    "instructor": "Debbie Wilson",
    "instructor_bio": "https://www.broadwaydancecenter.com/faculty/debbie-wilson",
    "description": "Feminine Commercial (Heels Optional): Ever want to take a Heels class without Heels? This is the class for you! In Feminine Commercial, you will find sexy dance movements (no jazz technique required) and heels are completely optional!"
  },
  {
    "date": "Wednesday, April 16",
    "time": "7:15 PM – 8:45 PM EDT",
    "name": "Basic AFRO'DANCE with Angel Kaba",
    "staff": "Angel Kaba",
    "room": "Room:Studio 2",
    "instructor": "Angel Kaba",
    "instructor_bio": "http://www.broadwaydancecenter.com/faculty/angel-kaba",
    "description": "Afro'Dance class is a mixture of the new generation of African influences and street dance. In the class you will work on musicality heavily influenced by the rhythm and musical trends from The Congo, Ivory Coast, Angola... Urban street styles are incorporated into the backdrop of this heavily African based technique. The cultural, social, and free-spirited side of this class creates an environment where students dance, learn, have fun, and feel free."
  },
  {
    "date": "Wednesday, April 16",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "All Levels BURLESQUE JAZZ with Tony Guerrero",
    "staff": "Madeline Benoit (substitute)",
    "room": "Room:Studio 1",
    "instructor": "",
    "instructor_bio": "",
    "description": ""
  },
  {
    "date": "Wednesday, April 16",
    "time": "8:45 PM – 10:15 PM EDT",
    "name": "Adv CONTEMP FUSION with Andrew Mulet",
    "staff": "Andrew Mulet",
    "room": "Room:Studio A",
    "instructor": "",
    "instructor_bio": "",
    "description": "8-10 years of training"
  },
  {
    "date": "Wednesday, April 16",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Adv STREET STYLES with Eric Delgado",
    "staff": "Eric Delgado",
    "room": "Room:Studio 5",
    "instructor": "",
    "instructor_bio": "",
    "description": "In Eric's class you can expect to be challenged not just physically but also mentally as a dancer and artist. Eric uses his choreography as a medium to provide tools to help his students grow and learn how to build and be their own individual artists. By incorporating many technical aspects from house, locking, jazz, hip-hop styles, and other various styles, students will learn steps and lessons in a safe and encouraging environment for all walks of life and levels!"
  },
  {
    "date": "Wednesday, April 16",
    "time": "9:00 PM – 10:30 PM EDT",
    "name": "Int Adv HEELS EMPOWERMENT FOR CAMERA with Kayla Maria G",
    "staff": "Kayla Maria G",
    "room": "Room:Studio 3",
    "instructor": "",
    "instructor_bio": "",
    "description": "This class will be filmed every week. A style that allows you to explore your femininity while feeling confident in your body, mind, and soul. Each class starts with an Energy Talk where we discuss the kinds of experiences we should draw from. This allows us to make the movement our own and feel natural to our bodies. Understand that its not about being perfect but being ultimately you. Don't be afraid to take risks, it's the only way we grow."
  }
]